{
  "session_info": {
    "id": "MOZN",
    "name": "MOZN - Novel Particle Sources, Acceleration Techniques, and their Applications (Invited)",
    "url": "https://meow.elettra.eu/97/session/1166-mozn/index.html"
  },
  "papers": [
    {
      "paper_id": "MOZN01",
      "title": "Exploration of ultra-high dose rate radiobiology with laser-driven protons at BELLA30Laser-driven (LD) proton sources are of interest for various applications due to their ability to produce short proton bunches with high charge and low emittance. These sources can be used in biological studies investigating improvements to radiation cancer therapy. Recently, the differential sparing effect on normal tissues versus tumors using the delivery of high radiation doses >10 Gy at extremely high dose rates (DR), called FLASH effect, has received increasing attention. However, the molecular and cellular mechanisms underlying the sparing effect are not yet fully understood. To explore these mechanisms, we have implemented a beamline at the BELLA PW that delivers LD proton bunches at ultra-high instantaneous DR (UHIDR) up to $10^8$ Gy/s. This allowed us to investigate in vivo the acute skin damage and late radiation-induced fibrosis in mouse ears after UHIDR with 10 MeV LD protons and prescribed doses of several 10 Gy. We observe sparing of healthy mouse ear tissue after irradiations with LD proton bunches at UHIDR compared to irradiations with 300 kV x-rays at clinical dose rates and similar total dose. Recent improvements to the LD proton source, delivery beamline, and diagnostic suite have also enabled first peptide sample irradiations to explore the sparing effect on the molecular level. This talk will provide a summary of radiobiology research activities at the BELLA PW.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOZN01.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOZN01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-11-03 23:54:44"
}