{
  "session_info": {
    "id": "THP",
    "name": "THP - Thursday Poster Session",
    "url": "https://meow.elettra.eu/97/session/1194-thp/index.html"
  },
  "papers": [
    {
      "paper_id": "THP003",
      "title": "A compact 2D carbon beam scanner with interleaved saddle coils936Scanning magnets are used in proton and ion beam therapy to produce a radiation dose conforming to the cancerous tumor. In most existing beam delivery systems, two separate magnets are used to scan the beam in the transverse planes. To enable more compact systems and gantries, a combined function 2D scanner magnet with a short working distance is highly desirable. Earlier designs suffer from field non-uniformity in at least one plane. A compact 2D scanner magnet has been designed to produce high-field uniformity in both planes. The scanner was designed for carbon ions and could be easily scaled down for protons and other light ions. The design is based on saddle coils where the coils of the two magnets are interleaved to balance both field properties and power losses when scanning in both planes. The simulated field performance shows ~ 0.1% field uniformity in both planes within the useful aperture of the magnet . This represents a significant improvement over the prior art of the elephant-ear scanner design. Different design options and possible implementations will be presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP003.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP004",
      "title": "Advanced growth and characterization of alkali antimonide photocathodes for bright beam applications939The properties of the photoemitting electron sources are the most determining factors contributing to the performance of the most advanced electron accelerator applications such as particle colliders, X-ray free electron lasers, ultra-fast electron diffraction and microscopy experiments. Therefore, low mean transverse energy (MTE), high quantum efficiency (QE) along with long operational lifetime and robustness under high electric fields and laser fluences must be demonstrated by the photocathode for these bright beam applications. Recent investigations have revealed that the epitaxial growth of single crystal cesium antimonides can be achieved by photocathode growth on lattice matched substrates. In this letter, the experimental setup for highly promising alkali antimonide photocathode growth by molecular beam epitaxy on lattice matched substrates and in-situ characterization with reflection high-energy electron diffraction (RHEED) has been presented. To adapt the L-band RF gun of Argonne Cathode Test-stand (ACT) for extensive testing of alkali antimonides in real accelerator conditions, compatible cathode plug design and smooth transportation process have been developed and also described in this paper.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP004.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP005",
      "title": "Advancing conduction-cooled 650 MHz SRF technology for industrial accelerators at Fermilab's",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP005.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "IARC942",
      "title": "The National Nuclear Security Administration (NNSA) funds the Illinois Accelerator Research Center (IARC) at Fermilab in developing a high-power, conduction-cooled Superconducting Radio Frequency (SRF) accelerator tailored for industrial applications requiring robust and efficient operation. A 650 MHz, 1.6 MeV, 20 kW SRF accelerator is currently under development, employing a conduction cooling approach to simplify cryogenic requirements and enhance accessibility for industrial use. The accelerator's control system is implemented on the Blinky-Lite platform, selected for its open-source architecture, secure remote access capabilities, and operational flexibility—attributes advantageous for industrial deployment and sustained operation. A dedicated beamline is designed to measure essential beam parameters and test the integrated performance of the accelerator and control systems, thereby validating their operational readiness for intended applications.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-IARC942",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THP006",
      "title": "Advancing to 500 mA: High-Current Ramp-Up and Operational Experience at NSLS-II946Since the first light in 2014 at 50 mA, NSLS-II has steadily increased beam current, reaching 500 mA in October 2019. Along the way, various challenges were addressed, including RF power consumption, wakefield effects, and unexpected component heating. Key improvements included enhanced temperature monitoring with 600 new sensors, optimized RF spring installation, and the installation of a superconducting wiggler in 2022 to reduce vacuum heating further. As a result, vacuum temperatures now remain below 70°C at 500 m",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP006.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP007",
      "title": "Analytical model for the transition to superradiance in seeded free-electron lasers950Free-electron lasers (FEL) seeded by short radiation pulses can exhibit superradiant behavior. In the superradiant regime, the pulse simultaneously compresses and amplifies as it propagates through the FEL, making superradiance very promising for pushing the performance limits of attosecond x-ray FELs. To date, this regime has been studied in asymptotic limits, but there is no model for how the initially linear dynamics of the seeded FEL transition into the nonlinear superradiant behavior. We derive an analytical model for the 1D FEL seeded by a short pulse which accurately captures the linear dynamics, the nonlinear superradiant evolution, and the smooth transition between them. Our model fills a critical gap in our understanding of FEL superradiance and nonlinear time-dependent FEL physics more broadly, and may provide a bridge to the corresponding problem in three-dimensions, and analogous problems in other fields exhibiting soliton behavior.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP007.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP008",
      "title": "An electrostatic fusion collider for interstellar propulsion954In order to reach the nearest star Proxima Centauri within a century, a distance of 4.224 light-years from our solar system, the average spacecraft velocity needs to be 4.2% of the speed of light. Therefore, according to the rocket equation, the weighted average exhaust velocity needs to be over 1% of the speed of light for reasonable ratios of dry mass to fuel mass. The fusion reactor architecture presented herein consists of an electrostatic charged particle trap that brings two ion beams into collision with equal and opposite momentum. The two fusion channels under consideration for interstellar missions are p/Li7 and He3/He3, utilizing an array of low mass electrodes that minimize interactions with fusion daughters escaping from the collision point and focused to generate thrust. A prototype colliding beam accelerator has been built to determine the viability of achieving collider luminosities commensurate with the requirements of this application. A novel architecture overcomes past Coulomb scattering limitations. Reactor and propulsion system design parameters are presented in this paper along with preliminary prototype operational results with deuterium collisions.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP008.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP009",
      "title": "Automatic measurement of the stray magnetic field in the RCS locations of RHIC by using the SPOT robot957The Electron Ion Collider (EIC) will collide high energy and highly polarized hadron and electron beams with luminosities up to 10^34/cm^2/s. In the Conceptual Design Report baseline scope, the electron beams, accelerated in the Rapid Cycling Synchrotron (RCS), are vulnerable to the outside magnetic field due to its low injection energy at 400 Me",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP009.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP011",
      "title": "Beam bunchers for LANSCE modification project961The Los Alamos Neutron Science Center (LANSCE) accelerator complex delivers both protons and negative hydrogen ions with various beam time patterns simultaneously to multiple users. The LANSCE linac front end is still based on Cockcroft-Walton voltage generators. An upgrade of the front end to a modern, RFQ-based version – a part of the LANSCE Modernization Project (LAMP) – is now in the conceptual design stage. The LAMP will need beam bunchers both in the low-energy transport (LEBT, 100 keV) before RFQ, and in the medium-energy transport (MEBT, 3 MeV) after RF",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP011.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP012",
      "title": "Beam dynamics in LANSCE accelerator facility with lower energy964In operation of the LANSCE accelerator facility, occasionally it is required to provide beam at a lower beam energy than the nominal energy of 800 Me",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP012.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP013",
      "title": "Beamline optics design of a new two-room treatment suite at the McLaren Proton Therapy Center968A fixed-beam, two room suite with upright chairs for patient positioning, is being installed at the McLaren Proton Therapy Center (MPTC). The MPTC is an operational, multi-room cancer treatment center. The new suite adds a third (A) and fourth (B) room by branching off upstream of the two clinically active half-gantry treatment rooms. This imposed a number of constraints on the beamlines of the new suite. The new beamline uses a Y-shaped selection dipole to switch between the suite’s room A and room",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP013.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP014",
      "title": "Beam loss modeling and mitigation due to intra-beam stripping971Intra-Beam Stripping (IBS) is a critical beam loss mechanism in high-intensity H- linacs and presents a significant limitation to increasing beam power. This work presents a computational framework to evaluate and mitigate IBS-induced beam loss along the Spallation Neutron Source (SNS) LINA",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP014.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP015",
      "title": "BeamNetUS at Brookhaven National Laboratory975BeamNetUS is a national network of accelerator facilities that aims to provide broader access to the unique capabilities of accelerated particle beams. Two facilities at Brookhaven National Laboratory are part of the inaugural year of BeamNetUS, the Accelerator Test Facility (ATF) and the Low Energy Accelerator Development (LEAD) facility, and are scheduled to each host one BeamNetUS user experiment. The ATF features an RF photocathode electron LINAC, a femtosecond Ti:Sa laser, and a high-peak-power long-wave infrared (LWIR) laser. These tools can be synchronized for joint use or operated individually, facilitating the development of advanced beam manipulation and measurement techniques, accelerator and laser technologies, and the exploration of low-plasma-density regimes. The LEAD facility provides an ultrafast electron diffraction (UED) apparatus, utilizing an RF electron gun and Ti:Sa laser to enable dynamic studies of material structures, as well as investigations involving low-energy electron beams. In addition to these two accelerator facilities, Brookhaven National Laboratory provides administrative support for the network. Further expansion is planned for 2026, including both increased user hours at ATF and LEAD as well as the potential inclusion of several other facilities at the lab.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP015.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP017",
      "title": "Calculations of emittance measurements via inverse Compton scattering978Recent simulation work has indicated that next generation photoinjectors will be capable of delivering beams with emittances below 100 nm for bunch charges of a few hundred pico-Coulombs. Experimentally validating these results by measuring such emittances is challenging due to the high resolution required. Additionally, in some cases it is desirable for these characterization measurements to be non-destructive, and to have the capability of selecting subsets of the beam. One technique that has been considered is the use of inverse Compton scattering (ICS) spectra to measure the emittance. Here we present simulation results on the use of ICS to measure 50 nm – 500 nm emittances for a 250 pC bunch charge electron beam.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP017.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP019",
      "title": "Commissioning of the Complex Bend Prototype Beamline981For the NSLS-II upgrade, a novel Complex Bend (CB) optics solution has been proposed to achieve near-diffraction-limited emittance. A key challenge in this design is the requirement for high-gradient quadrupoles (150 T/m) in a compact space. To demonstrate feasibility, a CB prototype was developed and tested using the NSLS-II linac beamline, scaling the beam energy to 100–200 MeV while maintaining strong focusing. The prototype utilized a 16-wedge symmetric Halbach permanent magnet design, achieving a gradient of 140 T/m within ultra-compact quadrupoles. The CB beamline was installed and commissioned in two phases, first as a strong periodic focusing element and later as a combined bending and focusing system. The beam commissioning results showed good agreement with theoretical models, confirming that the Complex Bend functions effectively as both a strong focusing and bending element by offsetting CB poles. This validates the strong focusing design of the Complex Bend for future synchrotron light source upgrades.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP019.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP020",
      "title": "Critical design issues of the novel multi-beam LANSCE front end985The proposed novel 100 MeV injector for the modernization of the LANSCE Accelerator Facility* is aimed to replace the existing injector based on 750-keV Cockcroft-Walton columns. The specific feature of the LANSCE accelerator is the simultaneous delivery of beams with multiple beam flavors to several targets. Acceleration of various beams in a single RFQ provides less flexibility for optimal adjustment of acceleration and focusing parameters concerning the existing LANSCE setup caused by differences in beam current, charge per bunch, and beam emittances. An important issue in the low-energy beam transport of the proposed injector is the different levels of space charge neutralization of the multi-component beam. Coupling between degrees of freedom in the presence of strong space charge forces of the beams results in unavoidable beam mismatch in the Front End and requires careful six-dimensional matching of beams with accelerator structures. The paper discusses key issues in the planned Front End and suggests ways to mitigate them.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP020.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP021",
      "title": "IOTA experiment for proton pulse compression at extreme space-charge989A gammaT scheme may be required for the PIP-II era performance or ACE-MIRT era performance of the Booster. PIP-II era operations of the Fermilab proton complex will require the Fermilab Booster to increase beam intensity from 4.5e12 to 6.5e12 protons, while also increasing its ramp from 15 Hz to 20 Hz. These changes pose particular challenges for transition-crossing in the Booster, where longitudinal beam quality must be controlled in order to facilitate slip-stacking in the Recycler Ring later in the Main Injector cycle. Two novel gammaT jump schemes are proposed, termed “double gammaT jump” and “partial gammaT jump”, which optimize the magnitude of the gammaT jump within optics and power supply constraints.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP021.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP022",
      "title": "Design of a microbunched electron cooler energy recovery linac993Microbunched electron Cooling (MBEC), a type of Coherent electron Cooling (CeC), is a possible way to cool high energy protons; such an electron cooler can be driven by an energy recovery linac (ERL). The beam parameters of this design are based on cooling 275 and 100 GeV protons at the Electron-Ion Collider (EIC), requiring 150 and 55 MeV electrons, respectively. If implemented, a high energy cooler would serve to increase the average luminosity of the collider by mitigating the emittance growth caused by various processes. This ERL is designed to deliver a bunch charge of 1 nC, an average current of 100 mA, and strict requirements on the transverse emittance, slice energy spread, and longitudinal distribution profile. This paper covers the current state of the design.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP022.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP025",
      "title": "Development of sodium potassium antimonide photocathodes for use of coherent electron cooling997The Coherent Electron Cooling (CeC) technique is a breakthrough in accelerator science, enhancing ion beam brightness in facilities like the Electron-Ion Collider (EIC)*. The success of CeC relies on high-performance photocathodes (PCs) for photoinjectors, where ideal PCs exhibit high QE, low emittance, long lifetimes, and minimal dark current. Alkali antimonide PCs meet these requirements. Among these, Na-K-Sb shows enhanced robustness, particularly under high-temperature conditions from high-power laser illumination, which generates high current electron beams. It also demonstrates improved vacuum stability and long-term QE consistency compared to other alkali antimonides like K2CsSb and Cs3Sb. These attributes make Na-K-Sb an effective choice for applications requiring both thermal and vacuum stability. This work presents the growth of Na-K-Sb PCs using the CeC cathode deposition system**, alongside detailed QE measurements and spatially resolved QE maps. These findings highlight the potential of Na-K-Sb PCs to advance CeC performance significantly and foster the development of high current, high-brightness electron sources for broader applications",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP025.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP026",
      "title": "Development of superconducting adaptive gap undulator (SC-AGU)1000The concept of the AGU has been proposed for some time*. However, utilizing a permanent magnet-based device complicates the design due to the necessity of independent gap control for each segment and, in the case of an in-vacuum undulator, the requirement for a flexible continuity sheet to mitigate image current heating. The adoption of SC magnets eliminates these concerns. The SC-AGU prototype will comprise three sections of magnetic arrays with a total length of 120 cm, with the central section featuring a smaller gap than the end units. To achieve this, a UHV chamber will be designed for eventual fabrication, incorporating a non-uniform aperture that conforms to the beam envelope. Furthermore, to maintain a constant fundamental photon energy and maximize on-axis spontaneous emission, each SC section will be engineered with distinct period lengths, with the central section possessing a shorter period than the end units. This paper presents the methodology for end-field analysis, encompassing detailed simulations to characterize the magnetic field distribution at the extremities of each magnetic array. Particular emphasis is placed on the impact of field quality at junctions and its influence on radiation properties, ensuring the optimization of on-axis spontaneous emission while preserving the electron beam’s ‘stay-clear’ area and mitigating impedance constraints imposed by the undulator magnet structure.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP026.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP027",
      "title": "Development of the rocking curve imaging setup at BL17-2 at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP027.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP028",
      "title": "Digital twin framework for PIP-II linac: AI-driven multi-scale modeling from ion source to 800 MeV1007The PIP-II linac will enable >1.2 MW beam power for DUNE, requiring unprecedented operational reliability across its warm front-end (RFQ, MEBT) and five distinct SRF sections operating at 162.5/325/650 MHz. We present a comprehensive digital twin framework uniquely combining a fully differentiable fast beam transport code with neural network surrogates trained on high-fidelity PIC simulations, capturing space charge and nonlinear dynamics beyond traditional envelope codes while achieving 10⁴× speedup at &LT1% accuracy. End-to-end differentiability enables gradient-based optimization across 500+ parameters simultaneously—previously impossible with conventional tools—while the model incorporates static/dynamic errors and serves as a virtual commissioning platform for diverse hardware integration. The framework facilitates reinforcement learning for pulsed/CW mode transitions, predictive maintenance through anomaly detection, and autonomous tuning algorithm development with real-time execution capability. Validation against physics simulations shows excellent agreement for the front-end, with initial results demonstrating potential for 30% commissioning time reduction and proactive fault mitigation, providing a scalable blueprint for operating next-generation high-intensity accelerators.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP028.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP030",
      "title": "Emulation of two-pass gain in a cavity-based XFEL via self-seeding at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP030.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP031",
      "title": "Evaluating a transition-jump system for the Fermilab Main Injector using Xsuite1015We describe the development of a MADX-to-Xsuite simulation framework for the Fermilab Main Injector (MI) along with the subsequent evaluation of transition-crossing behaviors in the accelerator. In particular, we studied the introduction of quadrupole magnets into the lattice as part of a transition-jump system that will be implemented in the machine through the Second Proton Improvement Plan (PIP-II). Simulated beam losses spurred by transition-induced instabilities were assessed under several systematic effects, including MI quad errors, magnet-to-magnet variability in the jump magnets, emulated power supply errors, and timing jitter.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP031.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP033",
      "title": "Feasibility of proton bunch compression in an operational high-power accelerator1019A muon collider would require short, intense proton bunches to generate the initial muon beam. Preliminary designs assume the proton bunches are formed by charge-exchange injection from a linear accelerator into an accumulator ring, followed by longitudinal compression in a separate ring. We aim to experimentally study this compression scheme at the Spallation Neutron Source (SNS) at Oak Ridge National Laboratory (ORNL), which boasts a world-leading proton bunch intensity. The primary goal of these experiments is to benchmark simulations against turn-by-turn phase space measurements during the compression. Here, we describe the operating parameters of the SNS compared to the muon collider design, the capabilities of the current RF system, and the available beam diagnostics in the SNS accumulator ring. We also present initial simulations and experiments to judge the feasibility of the proposed research.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP033.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP034",
      "title": "Feasibility studies of the stochastic cooling system in the proton storage ring EDM experiment1023This study explores the feasibility of implementing stochastic cooling in the proposed proton electric dipole moment (pEDM) storage ring to be constructed at Brookhaven National Laboratory. Investigating fundamental physics phenomena, such as the electric dipole moment (EDM) of protons, demands highly precise experimental setups. In such precision experiments, intra-beam scattering (IBS) causes emittance growth, which degrades beam quality and limits the spin coherence time (SCT), a key parameter for sensitive EDM detection. The integration of a stochastic cooling system for stored polarized proton beams offers a potential solution by mitigating the effects of IBS, suppressing emittance growth, stabilizing beam dynamics, and enhancing the overall efficiency of the storage ring. This paper examines the feasibility of incorporating such a system into the proton EDM storage ring and evaluates its potential to preserve beam polarization and quality, both essential for advancing EDM experiment.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP034.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP035",
      "title": "Final design of CARIE photoinjector cavity with plug insert1027At Los Alamos National Laboratory, we finalized the design of a 1.6-cell C-band RF photoinjector cavity for the Cathodes And Radiofrequency Interactions in Extremes (CARIE) project. The photoinjector cavity is intended to operate at 5.712 GHz, with an intense electric field on the photocathode up to 240 MV/m, producing 250-pC electron bunches at room temperature. The photoinjector cavity design focused on minimizing the peak electric and magnetic fields. The distributed RF coupling waveguide network design was optimized for achieving minimized vacuum pressure at the photocathode plug emitting surface. We report the RF simulation and vacuum simulation results of the photoinjector cavity. We also discuss the mechanical design considerations related to photocathode plug alignment, laser pipes, and baking out. The designed photoinjector cavity is currently under fabrication.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP035.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP040",
      "title": "Growth and characterization of GaAs-based spin-polarized photocathodes1030Spin-polarized electron sources find application in both high-energy and nuclear physics experiments. We describe in detail the design and characterization of different photocathodes based on GaAs/GaAsP superlattice structures. These structures are fabricated with a Distributed Bragg Reflector (DBR) aimed at achieving a high quantum efficiency (QE)~ 20\\% in addition to a high electron spin polarization (ESP) ~85\\% at the desired wavelength of 780 nm. We present the QE and ESP measurements of photoemitted electrons as a function of wavelength of incident light, along with morphological and photoluminescence measurements.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP040.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP041",
      "title": "High Energy Heavy Ion Single Event Effects (HE HISEE): Planning for the future of microelectronics1034One unique accelerator application is the testing of microelectronics for utilization in space. In particular, space provides two environment challenges that provide exposure to energetic heavy ions: galactic cosmic rays (GCRs) and solar particle events (SPEs). These particles cause risk by depositing charge in microelectronics potentially causing operational errors or even destructive failure. Testing electronics with a variety of ground-based accelerators is not new. What is new is the increasing need for high-energy (> 100 Mev/n) heavy ions with ~40% of all testing predicted to require this high energy by 2030. This is primarily for two reasons: - Mission-enabling advanced stacked microelectronics technologies such as 3D packaged devices that require higher energy to penetrate to the sensitive locations within these devices, and, - Increase in demand to perform system-level testing using “large irradiation area” kinematics. This large area also allows for large sample sizes to be irradiated simultaneously for efficiency. Presently, the is only one domestic accelerator that can achieve high energy heavy ions, that of Brookhaven National Laboratory’s NASA Space Radiation Laboratory. Here, we discuss the requirements needed by the test community and the domestic effort to close the gap in the number of test hours. A current government-funded study is underway to analyze options for the future.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP041.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP042",
      "title": "Hollow-core anti-resonant fiber optics as a path towards practical laser-undulator based X-ray sources1037This talk will outline the potential for commercially available, hollow-core, anti-resonant optical fibers to overcome many of the challenges in creating monochromatic and coherent x-ray sources with laser-electron beam interactions. The differences between inverse Compton scattering and laser undulators will be explored and the immense difficulty in creating a laser undulator outlined. A proposed innovation is to utilize modern day, commercial hollow-core fiber optics to confine the laser and potentially allow for a laser-undulator to be constructed with current state of the art lasers and electron beams. Models of this externally confined laser undulator concept will be presented and plans for upcoming experiments shown.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP042.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP045",
      "title": "Implementation of electron–X-ray beam overlap diagnostic instrument at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP045.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP047",
      "title": "Isochronous induction cell storage ring1044A challenge in realizing a steady-state microbunching (SSMB) light source is achieving a high average current from a stored beam with a peak current low enough to avoid collective effects that spoil the longitudinal phase space. We plan to investigate resolving this challenge by combining recent advances in isochronous transport and induction cells. The recently commissioned SLS-2 upgrade uses an anti-bend arc cell to control dispersion and reduce emittance. We use this anti-bend design to yield an arc whose R56 can be adjustable to near-zero on a per-arc basis. This fine control of momentum compaction allows for better mitigation of effects that spoil the longitudinal phase space. A consequence of RF technology, which most ring-based light sources use, is that high average current can only be achieved by pushing peak current, as only 1-2% of the circumference actually stores current. High peak current drives other design considerations which result in a fast churning of the longitudinal phase space. A ring with low peak current to avoid this churning has an average current too low to make a useful SSMB light source. Induction cells with a reset time of ~10 ns have recently been developed for cinematographic radiography. An induction cell could allow over 95% of the ring to store current, yielding a high average current and low peak current. Here we outline an investigation to explore the beam dynamics and technology of such an isochronous induction cell storage ring.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP047.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP048",
      "title": "LAMP Front-End RFQ optimization for micropulse production1048The LANSCE Modernization Project (LAMP) aims at upgrading the front end of the LANSCE accelerator, involving one single radio-frequency quadrupole (RFQ) at 201.25 MHz for simultaneously accelerating both proton (H+) and negative hydrogen ion (H-) beams from 100 keV to 3 Me",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP048.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP051",
      "title": "Low Energy Accelerator Development Facility upgrades1051The Low Energy Accelerator Development (LEAD) Facility * is a part of the Accelerators Facilities Division (AFD) of the Brookhaven National Laboratory (BNL). The facility has three capabilities and runs a program specifically targeting new collaborations for user-driven research. The first and the oldest of the capabilities is the Ultrafast Diffraction (UED) Capability. The other two are radiation-shielded bunkers. At the UED the deployment of a new stable solid-state modulator and klystron is in progress. The beamline updates are now going into place for a NASA Jet Propulsion Laboratory ** electron irradiator beamline for Single Event Effects (SEE) testing; and the capability for UED testing is being expanded. In both bunkers (153 and 77 sq. m) a range of cooling, air, electrical, and RF capabilities are presently being introduced. The first bunker will accommodate the Electron Cyclotron Resonance *** (eCRA) Demonstrator (a project together with Omega-P, R&D). The deployment is expected to start in the last quarter of 2025. The second bunker will accommodate the superconducting radiofrequency (SRF) photo-gun **** (a project by Euclid Techlabs, LLC) to be the electron beam source for an envisioned Ultrafast Electron Microscopy (UEM) Capability.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP051.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP052",
      "title": "Measurements of single-shot attosecond X-ray pulses at high repetition rate1055Electron dynamics in molecules occur on attosecond timescales and drive fundamental processes such as photosynthesis, catalysis, and chemical bond transformations. Understanding these phenomena requires tools with both high temporal resolution and the capability to probe molecular dynamics at high repetition rates. Here, we present the first single-shot measurements of attosecond soft x-ray pulses at the superconducting LCLS-II accelerator. Using an angle-resolving electron time-of-flight spectrometer, we perform angular streaking measurements with high energy and angular resolution, enabling a complete reconstruction of the spatial and temporal profiles of the pulses. These measurements showcase the attosecond science capabilities of LCLS-II at unprecedented repetition rates and provide the foundation for controlling and shaping x-ray pulses to study ultrafast dynamics in complex systems with precision.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP052.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP053",
      "title": "Measuring orbit responses with oscillating trajectories in the Fermilab Linac1057Recording changes in beam transverse positions and longitudinal phase reported by Beam Position Monitors (BPMs) in response to a beam deflection by an upstream dipole corrector or RF cavity phase (orbit response) is a powerful tool for analysis of accelerator optics and assisting with machine tuning. In Fermilab Linac, orbit responses were recorded by oscillating the corrector currents and cavity phases in a sinusoidal manner parasitically during regular operation, simultaneously oscillating up to 19 correctors and 7 cavities at distinct frequencies, providing faster, drift-resistant measurements through frequency-domain analysis. This report describes the technique, including error estimations and consistency checks and shows examples of the measurements.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP053.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP054",
      "title": "Mitigating transition in the Fermilab Booster using a triple phase jump1061The PIP-II project currently under construction will boost neutrino production for DUNE, Fermilab's flagship long baseline neutrino oscillation experiment, by doubling the beam power delivered by the accelerator complex. To accomplish this, the total charge injected from the linac into the existing Booster RCS ring will increase from 4.5 to 6.5E12 while the machine ramp rate will be raised from 15 to 20 Hz. The Booster accelerates beam from 800 to 8000 MeV and crosses transition at $\\gamma = 5.45$ In current, pre PIP-II operations, no formal gamma-t jump system is used and the longitudinal emittance blowup is limited with an active quadrupole mode feedback system. Due to the slip-stacking process used in the dowstream Recycler Ring to accumulate and increase bunch intensity, to prevent excessive particle loss the longitudinal emittance at extraction limited is set to 0.1 eV-s (95\\%). Given that collective fields scale with intensity, it is anticipated that additional measures will need to be put in place to meet this requirement. We look at the so-called triple phase-jump technique a possible candidates for transition mitigation and present some simulation results. Despite known limitations, attractive aspects of the triple jump are that the phase manipulations are incorporated within the digital LLRF system; no additional magnets or pulsed power supplies are needed and the technique is compatible with active quadrupole mode feedback.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP054.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP055",
      "title": "Multi-GeV FFA beam transport test at CEBAF1064Jefferson National Lab plans an upgrade project to reach 22 GeV high polarization electron beam by using Fixed Field Alternating-gradient (FFA) magnets. The utilization of the FFA magnets for 10-22 GeV beam energy range is unexampled, therefore those magnets need an experimental validation before their full installation to form an arc in the Continuous Electron Beam Accelerator Facility (CEBAF). For this reason, JLAB is also considering the design of an FFA magnet test bench, i.e. a half or full FFA cell, that would be deployed in the current CEBAF in order to serve as the highest energy demonstration for the FFA field uniformity, permanent magnet resiliency with the beam as well as enabling beam optics measurements with the 5-11 GeV range highly polarized beams which closely resembles the full energy range of the 22 GeV upgrade. In this report, we present the status of the planned beamline for the FFA beam transport test at CEBAF.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP055.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP056",
      "title": "Transport of 12 GeV positron beams at Ce+",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP056.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP058",
      "title": "Optimization of kicker location for pseudo single bunch operation in SPEAR31071The Pseudo Single Bunch (PSB) operation mode is being developed at Stanford Synchrotron Radiation Lightsource (SSRL) to address growing interests from time-resolved experiments. To accommodate both regular user and timing user experiments simultaneously, a fast electron kicker will be installed in one of the long straight sections at SPEAR3. This kicker will provide a large spatial separation between the main bunch trains and the camshaft bunch. The resulting x-ray spatial separation from undulator beamlines will be highly dependent on the location of the PSB kicker to be installed. We present here considerations of the PSB kicker location with beamline simulations for both low and high repetition rate modes.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP058.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP059",
      "title": "Orthogonal directions constrained gradient method for beam optics correction1075An Orthogonal Directions Constrained Gradient Method (ODCGM) has been developed and experimentally used for optimization and correction of H$^-$ optical beam parameters for laser assisted charge exchange injection (LACE) experiments. LACE experiment requires precise tune up of H$^-$ beam parameters for high efficiency stripping. High precision tuning of beam parameters cannot be done in one step due to miscellaneous errors of power supplies and other factors. Then, subsequent application of the optic correction method considered here can do fine tune up of the beam. A simple experimental demonstration of ODCGM is presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP059.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP060",
      "title": "Performance requirements for the LANSCE Accelerator Modernization Project1078The LANSCE accelerator concurrently accelerates two beam species, H+ and H-, and delivers beam to five distinct user stations, including slow and fast neutron scattering centers, ultra-cold neutron research, proton radiography, and isotope production. The LANSCE Accelerator Modernization Project (LAMP) will replace the initial sections of LANSCE, from sources through the end of the 100-MeV drift-tube linac. The combination of multiple user stations, and the unique operation of LANSCE, present unique challenges and opportunities. In this paper, we present the performance requirements for LAMP, an overview of the project status and timeline, an overview of the conceptual design, and outlook.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP060.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP061",
      "title": "Photon stimulated desorption beamline at NSLS-II1081Understanding synchrotron induced gas desorption plays an important role in predicting vacuum behavior of accelerators. Investigations of new materials and coatings require careful study of their desorption yield for potential use in upgrading NSLS-II as well as other accelerator facilities. A beamline at NSLS-II, dedicated to the study of novel and proposed vacuum materials has been constructed and commissioned to advance further research into desorption behavior. The PSD of stainless steel, OFHC copper and NEG coated copper, some of which for use in the future Electron-Ion Collider at BNL, have been measured and will be presented. These newly established desorption rates will be used as inputs to advanced modeling tools such as MolFlow+ and SynRad+ for accurate predictions of vacuum behavior and design optimization. The existing layout and future plans for the beamline will be presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP061.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP062",
      "title": "Physics model to study resonant compton scattering1085Over the past several decades, the elastic interaction between photons and electrons known as Compton scattering, has been the foundational mechanism for generating high-energy photon beams, particularly in the gamma-ray regime. Resonant interactions between photons and atomic systems offer significantly enhanced resonant cross-sections, often several orders of magnitude greater than what is achievable through conventional Compton scattering of electron and photon beams. The Gamma Factory initiative at CERN aims to exploit this enhancement by employing ultra-relativistic, partially stripped ion beams to generate high-intensity gamma-ray beams. In this work, we first examine the energy-matching requirements for resonance. We then present a semi-classical model based on a damped-driven oscillator to describe resonant Compton scattering. This model provides physical insight into the resonant cross-section and the limitations imposed by beam-beam interactions. We also propose a framework for simulating the scattering process.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP062.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP064",
      "title": "Radioisotope production at SNS (RIPS)1089A unique opportunity exists to investigate alternative radionuclide production technologies utilizing the high-energy proton beams available at the Spallation Neutron Source (SNS) at Oak Ridge National Laboratory (ORNL). The Second Target Station (STS) is being built to address emerging science challenges in energy, security, and transportation. The STS will complement the capabilities of the First Target Station (FTS) and High Flux Isotope Reactor (HFIR) by filling gaps in materials research that require the combined use of intense, long-wavelength (cold) neutrons, and instruments that are optimized for exploration of complex materials. The construction of the STS beamline to the target also presents an opportunity to capitalize on additional applications, such as the production of high-demand radioisotopes for medical applications. Work began in 2024 to investigate the possibility of Radioisotope Production at SNS (RIPS) through four main goals: (1) identification of isotopes of interest through the modeling and simulation of prospective irradiation parameters and target compositions, (2) development of a target design concept that can receive high energy beam pulses from the SNS accelerator, (3) identification of enhanced isotope separation methods for SNS produced radionuclides, and (4) a design concept for an experimental/demonstration facility. An overview of the project and progress towards achieving these goals will be presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP064.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP065",
      "title": "Radioisotope production at the Spallation Neutron Source: Design concept of experimental target station1093Completion of the Proton Power Upgrade Project for the Spallation Neutron Source (SNS) accelerator at Oak Ridge National Laboratory opens an opportunity to utilize reserve beam power of more than 100 kW for applications beyond neutron production. One of these applications is the production of critical radionuclides. To demonstrate the feasibility of using the reserve beam power to produce radioisotope at SNS, a design concept of a small-scale experimental target station in the Linac Dump area has been developed. This experimental facility will provide isotope yield benchmarking data using protons in the GeV range. It will also enable additional research and development in isotope handling and radiochemical separation. The target station consists of a target module enclosed in a vessel and concrete shielding. Particle transport calculations and thermo-mechanical simulations are used to determine beam parameters, decay time, isotope yield, shielding dimensions, and target design parameters. Calculations verified that the irradiated capsule can be handled manually using hands-off tools and transported to a hot cell in a shielded container for post-irradiation characterizations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP065.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP066",
      "title": "Radioisotope production at the Spallation Neutron Source: Design concept of isotope production target1097Upon completion of the Second Target Station (STS) Project in the mid 2030s, the Spallation Neutron Source accelerator at Oak Ridge National Laboratory will deliver a 2.7 MW proton beam to the neutron production targets. In the post-STS phase, the accelerator will have a reserve beam power capacity of at least 100 kW beyond what the two neutron production targets will receive, which could potentially be ramped up to 300 k",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP066.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP070",
      "title": "Simulation of the thermoelectric effect in a multi-metallic superconducting cavity1101Superconducting radio-frequency accelerating cavities made with different material layers, such as copper, Nb or Nb₃Sn, are susceptible to thermoelectric effects due to differences in Seebeck coefficients between the metals. A temperature gradient across the surfaces can drive thermoelectric currents, which may impact the cavity performance. A layered Cu/Nb/Nb3Sn single-cell cavity was tested with cryocoolers in 2022. Three heaters were mounted on the cavity surface at different locations and three single-axis cryogenic fluxgate magnetometers were attached close to the cavity equator. A linear increase in the magnetic field was measured while increasing the heaters' power. The cavity setup was analyzed with COMSOL and the results showed a trend similar to that observed in the experiment. This contribution details the approach chosen for the simulation and some of the challenges encountered.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP070.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP071",
      "title": "Simulations of positron injector for Ce+",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP071.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP072",
      "title": "Single-shot longitudinal phase-space measurement of thermionic-cathode gun beam at the APS linac*1109Advancements in particle accelerator technology hinge on our ability to precisely measure and understand the behavior of high-brightness beams. Following the installation of the new photo-cathode gun (PCG) laser at the front-end of the Advanced Photon Source (APS) linac, commissioning studies are needed to understand and bring the new PCG beam up to operational standard. In the present work, we present initial measurements characterizing the longitudinal phase-space of the thermionic-cathode gun (TCG) electron beam using a transverse deflecting cavity (TCav) located at the end of the APS linac. Downstream of the TCav, which deflects the beam vertically, lies the B1 horizontal bending magnet and three Chromium Oxide screens placed at three different locations where the beam is intercepted and imaged. Measurements of the TCG beam longitudinal phase-space are discussed and compared to previous measurements of the PCG beam longitudinal phase-space.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP072.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP074",
      "title": "SLAC MeV ultrafast electron diffraction facility upgrade plans1113Mega-electronvolt ultrafast electron diffraction (MeV-UED) is a complementary tool to X-ray based instruments that has enabled ground-breaking studies in condensed matter physics and chemical science. The SLAC MeV-UED facility uses a state-of-the-art 1.6-cell RF photoinjector to deliver 3 to 4 MeV electrons for a variety of pump-probe studies in solids, liquids, and gases, with over 6600 delivered hours and >87 publications since 2021. To broaden the scientific opportunities, facility expansion and enhanced instrument performance of MeV UED have been heavily requested. We discuss near and long-term plans for upgrade and expansion of MeV-UED, with anticipated improvements in beam delivery, system performance, data acquisition, and temporal and momentum-space resolution.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP074.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP076",
      "title": "Spin-transparent storage rings for quantum computing1116Spin-transparent storage rings, where any spin direction repeats after one full turn, can be used in conjunction with ion traps as a new quantum computing platform [1]. Advantages of spin-transparent rings for quantum computing include: large numbers of stored qubits; long quantum coherence times of up to several hours; long storage lifetimes; and room temperature operation. These exceptional qualities mean rings could provide a scalable way to implement algorithms with deep complexity requiring many quantum operations while simultaneously providing a large number of qubits. This new platform where the qubit has long quantum coherence time can also be used as a quantum sensor or a part of a quantum memory.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP076.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP077",
      "title": "Status of MicroBeam Linatron (MBL) product line development at Varex Imaging Corporation1120The High Energy Systems (HES) group at Varex Imaging Corporation (Varex) introduced a new concept and design for Accelerator Beam Centerline (ABC) (patent pending), which can be used on compact commercial electron linear accelerators in 1-20 MeV energy range, delivering substantially reduced, less than 0.5 mm focal spot on a beam stopping target in order to improve imaging qualities with the produced Bremsstrahlung. The first 6 MeV prototype tests have been completed successfully, and the work continues to build and test a 3 MeV and 9 MeV ABC prototypes. These linac systems received a brand name MicroBeam Linatron (MBL) series. The design and experimental data obtained up to date are presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP077.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP079",
      "title": "Study of nonlinear beam dynamics of an asymmetric NSLS-II lattice1123NSLS-II is planning an upgrade to an ultra-low emittance storage ring using a novel lattice concept, the complex bend, composed of combined-function magnets. To evaluate technical challenges and study beam dynamics with complex bend, two bending magnets of existing NSLS-II bare lattice are proposed to be replaced with complex bends, introducing lattice asymmetry. To study the impact of asymmetry on NSLS-II bare lattice, an asymmetric lattice is developed by adjusting quadrupole triplets in the Cell 8 long straight section. This paper presents the modified linear optics, optimization of nonlinear dynamics, and a comparison with the nominal bare lattice. The optimized asymmetric bare lattice is also experimentally measured in the machine, and dynamic aperture measurements are reported.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP079.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP081",
      "title": "The APS linac RF station upgrading status1126The Advanced Photon Source (APS) linac has reliably delivered high-quality electron beams for over 30 years. To support the APS Upgrade and ensure continued operation, a major refurbishment is underway. As part of this project, two of the linac's five operating radio frequency (RF) stations have been upgraded with solid-state modulator-powered klystrons and new digital low-level radio frequency (LLRF) systems. This upgrade has notably improved the linac's performance. This paper summarizes these improvements and outlines our next plans.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP081.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP084",
      "title": "The potential high orders of vertical electric field systematic effect due to hyperbolic/elliptical deformed electrode plates in the proton-EDM ring1128To achieve high precision in a storage ring experiment, it is essential to eliminate field errors up to a certain order to ensure they do not contribute to systematic effect to the experiment. In this study, we modeled electrode plates of electrostatic deflector with hyperbolic/elliptical shape deformation schemes. We analyzed the resulting beam dynamics and spin effects caused by these higher-order electric field errors and explored the potential systematic effects introduced by such deformed electrostatic deflectors within the proton Electric Dipole Moment (pEDM) Symmetric-Hybrid ring design*.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP084.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP086",
      "title": "Time-of-Flight energy measurements with BPMs1132The energy of a bunched non-relativistic ion beam can be deduced from measuring the beam phases in neighboring Beam Position Monitors (BPMs). This report presents estimations on implementation of such a procedure at PIP-II H- linac being constructed at Fermilab. In part, the case when the flight time between BPMs is larger than the period of BPM frequency is considered in detail. When the absolute BPM phase calibration is not available, the BPM phase information can be used to trace deviations of the beam energy from the desired value. Such “energy deviation” parameter is operationally implemented at the transfer line between 400 MeV Linac and the Booster, and its analog is expected to be used in the transfer line from PIP-II as well.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP086.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP089",
      "title": "Traveling-wave chopper structures for LANSCE modification project1136The Los Alamos Neutron Science Center (LANSCE) accelerator complex delivers both protons and negative hydrogen ions with various beam time patterns simultaneously to multiple users. The LANSCE linac front end is still based on Cockcroft-Walton voltage generators. An upgrade of the front end to a modern, RFQ-based version – a part of the LANSCE Modernization Project (LAMP) – is now in the conceptual design stage. The LAMP will need fast beam choppers both in the low-energy transport (LEBT, 100 keV) before RFQ, and in the medium-energy transport (MEBT, 3 MeV) after RF",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP089.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP091",
      "title": "Tuning of a force-neutral adjustable-phase undulator1140We present a hybrid permanent magnet-based adjustable phase undulator, featuring a period length of 17.2 mm, a gap of 8.5 mm, and a total length of 2.4 m. This planar polarized undulator adjusts field intensity through longitudinal jaw movement, with mechanically linked magnet arrays ensuring smooth motion. Building on previous work, this report focuses on newly developed tuning techniques for trajectory and phase error correction. Our engineering experience demonstrates the effectiveness of these methods in optimizing undulator performance.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP091.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP093",
      "title": "Update on septum magnet redesign at LANSCE Proton Storage Ring1143We report the progress of redesigning the septum magnet at the LANSCE Proton Storage Ring (PSR). The septum magnet at the PSR is used for extracting the accumulated 800-MeV proton beams for transport to the target stations. The existing septum magnet uses parallel, planar coils creating a uniform deflecting magnetic field. However, one coil plate co-locates with the septum; this placement results in the coil, witnessing intense radiation dose rates, receiving accumulated damage to the epoxy potting during the PSR operation. The redesigned septum magnet uses a ferritic steel septum, and the coils are positioned farther away from the proton beam pipes. This placement, combined with the adoption of a more radiation-resistant potting epoxy, is expected to reduce the dose rate on the coil pack, correspondingly increasing the operating lifetimes. The magnet pole tips are refined with shim features to provide a wide flat-field region. The mechanical engineering of the yoke components and the supporting structures is underway. Particle tracking simulations of the proton beam deflection in the septum magnet were performed, and the comparison of performance between the existing and the redesigned septum magnets is reported.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP093.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP094",
      "title": "Updates on scientific and R&D highlights at SLAC MeV-UED facility1146Ultrafast electron diffraction using MeV energy beams (MeV-UED) has enabled unprecedented scientific opportunities in the study of ultrafast structural dynamics in a variety of gas, liquid and solid-state systems. The SLAC MeV-UED program began in 2014 and became an LCLS user facility in 2019. This work will review recent R&D efforts for enhancing the resolution, flux and electron detection of the MeV-UED instrument. Additionally, the integration of Al/ML techniques is being explored to optimize facility operations and accelerate scientific discovery. In all, these will open new avenues for explorations in key areas of ultrafast science.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP094.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP095",
      "title": "User research at BNL’s Accelerator Test Facility1150The Accelerator Test Facility (ATF) at BNL is the DOE Office of Science User Facility for Accelerator Stewardship, featuring a high-brightness, 80-MeV electron LINAC, near-infrared (NIR) lasers at 1.06 and 0.8 µm, and a 5-TW, 2-ps long-wave infrared (LWIR) 9.2-µm laser. ATF is advancing LWIR laser technology toward the multi-terawatt, femtosecond regime—a major milestone in this spectral domain. Its unique suite of synchronized or independently operated capabilities enables breakthroughs across a broad range of studies, from materials science to Homeland Security, and from advanced radiation sources to novel methods of particle acceleration. Research priorities are shaped by community input through ATF User Meetings and Science Planning Workshops. A key focus is leveraging the co-location of the LINAC and “multi-color” lasers to place ATF at the forefront of THz to hard x-ray radiation sources, plasma physics, and advanced accelerator R&",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP095.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP095",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THP096",
      "title": "Visualization tools for EGUN simulations1153DC electron guns are essential sources of moderate-energy electron beams for both particle accelerators and klystrons. EGUN is one of the simulation software that is employed to design such DC guns. EGUN produces detailed data of electron rays trajectories for a given gun geometry, cathode temperature, bias-voltage, and beam current - whether space-charge limited or not. We use Mathematica and Python for advanced mathematical processing and visualization of the EGUN data visualization. For example, we generate phase-space plots at various longitudinal cross-sections and show the evolution of phase-space parameters along the beam axis. The visualization we generate is much richer than the simple trajectory plots generated by EPLOT software that accompanies EGU",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/THP096.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-THP096",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 63,
  "scrape_time": "2025-11-04 09:37:34"
}