{
  "session_info": {
    "id": "TUP",
    "name": "TUP - Tuesday Poster Session",
    "url": "https://meow.elettra.eu/97/session/1178-tup/index.html"
  },
  "papers": [
    {
      "paper_id": "TUP002",
      "title": "A beam chopping scheme concept for the new LAMP",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP002.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MEBT342",
      "title": "As part of the LANSCE Accelerator Modernization Project (LAMP), the two existing 750-keV Cockcroft Waltons are planned to be replaced by a single radio-frequency quadrupole (RFQ). The new LAMP front-end needs to deliver beams with similar timing patterns to what is currently delivered to the multiple target stations. To accomplish this, the 3-MeV Medium Energy Beam Transport (MEBT) is designed with two choppers that help produce beam timing patterns required by the experimental user facilities. The new RFQ will introduce satellite bunches around the single high-intensity bunch that is required by the users. These satellite bunches need to be removed in the MEB",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MEBT342",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUP003",
      "title": "Accelerator physics requirements and challenges of RF based electron cooler for EIC injection energy346Cooling of hadrons in Electron Ion Collider (EIC) at the injection energy is critical to achieving EIC design parameters. A 13 MeV electron cooler fit for the task is presently under design. This cooler will use RF-accelerated electron bunches and will provide strong cooling of the hadrons having energy of 24 GeV/nucleon. The paper describes optimization of the cooling performance, taking into account space charge, IBS and other effects, and provides physics requirements for the cooler.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP003.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP004",
      "title": "A community effort toward a Particle Accelerator Lattice Standard (PALS)350A major obstacle to collaboration on accelerator projects has been the sharing of lattice description files among modeling codes. To address this problem, a standardized lattice description called the Particle Accelerator Lattice Standard (PALS) is being developed. PALS development is a community-wide international effort involving accelerator physicists from multiple institutions. Along with the standard, interface packages written in commonly used languages will be developed. The importance for developing PALS is due to the increase in scale and complexity of new machines bringing an ever greater need for global collaboration, as well as interfacing with the data-driven activities using artificial intelligence and machine learning. The proposed Particle Accelerator Lattice Standard aims to promote: (i) portability between applications, (ii) a unified open-access description for scientific data (publishing and archiving), (iii) a unified description for post-processing, visualization and analysis. We will present an introduction to the effort, an overview of the standard, examples of applications, and discuss plans and future involvements from the community.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP004.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP006",
      "title": "A higher momentum aperture lattice proposed for the sPHENIX background problem354During the 2024 Au+Au 100 GeV physics run, the sPHENIX MVTX detector experienced background issues originating from the Yellow beam, leading to frequent auto-recoveries during streaming mode operation. One hypothesis attributes the background to the loss of off-momentum particles. An evaluation of the momentum apertures in both RHIC rings revealed that the Yellow ring had a worse momentum acceptance compared to the Blue ring. To address this, a new lattice design with a reduced W-function was proposed. This report presents the momentum aperture comparison between the two rings, the proposed new lattice design considering additional constraints, and the resulting momentum and dynamic apertures.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP006.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP007",
      "title": "A multi-harmonic cavity system for bunch lengthening for the NSLS-II upgrade357We discuss a bunch lengthening scheme based on the combination of Higher Harmonic Cavities (HHCs) of different order, aimed to provide a higher bunch lengthening factor then HHC systems of the same order. The stability and performance of the HHCs scheme is studied numerically with parameters of the NSLS-II upgrade.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP007.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP008",
      "title": "Analysis of the elliptic integrable non-linear system in IOTA using tracking of a single electron361Integrable nonlinear lattices that can be realized in practical accelerators are of great interest, as they offer the potential to support high-intensity beams via Landau damping of collective instabilities. One such system, based on an elliptic potential, has been extensively studied at the IOTA storage ring at Fermilab. The analysis of strongly nonlinear dynamics with multi-particle bunches is challenging due to the rapid decoherence of kicked beams. IOTA has the capability to track single electrons using linear multi-anode photomultiplier tubes for simultaneously measuring transverse coordinates and arrival times of synchrotron-radiation pulses. This technology enables the full reconstruction of turn-by-turn positions and momenta in all three planes for a single particle. Using this apparatus, we measured the dependence of small-amplitude tunes on the strength of the nonlinear magnet, as well as tunes dependence on oscillations amplitudes.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP008.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP009",
      "title": "An extended Froissart-Stora formula for changing crossing speed364When the closed-orbit spin tune is ramped linearly through an isolated spin-orbit resonance, the asymptotic polarization loss is well-approximated by the Froissart-Stora formula. However, it is often observed in accelerator simulations that the crossing speed, defined as the slope of the amplitude-dependent spin tune with respect to the machine azimuth, changes at the moment of resonance crossing. For example, the behavior of the amplitude-dependent spin tune in the vicinity of a higher-order spin-orbit resonance can often be reasonably approximated by such a piecewise-linear function. In this paper, we derive an extension to the Froissart-Stora formula which describes the asymptotic polarization loss in the case of changing crossing speed. We then demonstrate that this formula provides a good estimate of the polarization lost when crossing a higher-order spin-orbit resonance in both a toy model and simulations of RHIC.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP009.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP011",
      "title": "Aspects of stroboscopic averaging for the invariant spin field368A new method is formulated for calculating the invariant spin field (ISF) at a phase space point by leveraging the property that spins which are distributed along the ISF achieve maximum time-averaged polarization. To quantify this, we construct the time-average of spin rotation matrices beginning at a certain phase space point. It is recognized that the ISF vector at that point achieves the matrix-norm, meaning that the ISF corresponds to the first right-singular vector of that matrix. We show the relation of this method with traditional stroboscopic averaging, such that these methods are two sides of the same coin. This approach offers a new perspective in invariant spin field calculations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP011.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP012",
      "title": "Beam-based measurement of LCLS-II injector solenoid misalignments371Solenoid focusing is commonly used in accelerators for electron-beam containment and to compensate for space-charge induced emittance growth at low beam energies. However, misalignment between the solenoid field and the beam trajectory can result in degraded emittance compensation due to orbit kicks, dispersive effects, and non-linearities in the magnetic field profile. This paper presents a technique for beam-based measurement of solenoid misalignments, using expressions derived from a hard-edged solenoid linear transfer matrix with known beam parameters. The results of measurements conducted at the LCLS-II injector are presented as a validation of this method, along with simulation studies that estimate the impact of solenoid misalignments on emittance growth.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP012.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP014",
      "title": "Beam-beam limitation toward 10^34 cm^−2 s^−1 luminosity for Electron-Ion Collider375Achieving the design luminosity of in the Electron-Ion Collider (EIC) requires a deep understanding of beam-beam interaction limits in a weak-strong collision regime with flat hadron beams. This contribution presents recent studies of synchro-betatron resonances --- particularly the coupling resonance $2\\nu_x-2\\nu_y+p\\nu_z=0$ --- that can induce emittance transfer between the horizontal and vertical planes and limit luminosity performance. We identify the hourglass effect, caused by the proton bunch length being comparable to the vertical beta functions of both beams at the interaction point (IP), as the dominant source driving this resonance. We further investigate how physical noise, such as intra-beam scattering and fluctuations in the electron orbit and beam size, couples with the beam-beam interaction to amplify emittance growth and reduce luminosity. Mitigation strategies are also discussed. These studies provide important guidance for future EIC operation and inform strategies for potential upgrades.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP014.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP015",
      "title": "Beam halo formation with different cathode distributions379Beam halo refers to the low-density distribution of particles extending beyond the beam core, and its generation and mitigation are important topics in particle accelerator design. Effective mitigation of beam halo is essential for the cooler design based on Energy Recovery Linac (ERL), which must deliver an electron beam with average beam current of 100 mA and a charge 1 nC per bunch. In the ERL injector and booster linacs, space charge effects are stronger due to relatively low beam energy (6 MeV). Additionally, the longer bunch length of approximately 100 ps in this regime vs the RF period of 5.08 ns makes the formation of beam halos more likely. Therefore, effective collimation of beam halo is critical to maintaining the required beam parameters. To design an effective collimation scheme, several halo distributions were generated at the cathode and used to study halo formation within the injector-merger. This paper presents different halo distributions and halo formation, providing insights on halo collimation strategy.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP015.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP016",
      "title": "Beam tilt characterization using passive streaking structures383Passive wakefield devices such as corrugated structures have demontrated great potential for longitudinal phase space control and diagnostics in FE",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP016.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP017",
      "title": "Realistic simulation of the 76-inch cyclotron: COMSOL magnetic-field export integrated with an opal particle-tracking model387Accurate studies of particle behavior in accelerator chambers require precise magnetic field maps with regard to the iron geometry. We generated a realistic magnetic-field map for the 76-inch cyclotron at Crocker Nuclear Lab using COMSOL Multiphysics, then imported it into the OPAL (Object-Oriented Parallel Accelerator Library) software to model particle trajectories. It accurately simulates beam dynamics, provides reliable validation against measured data, and establishes a foundation for future cyclotron optimization and upgrades.S. PAI,",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP017.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP019",
      "title": "Power loss induced by welding beads in the HSR beam screen of the Electron-Ion Collider390GdfidL has been used to calculate the resistive wall heating in the vacuum components of the Electron-Ion Collider (EIC). In this paper, we present the simulation results for the beam-induced resistive wake potentials in various vacuum components of the EIC, including the beam screen and the hadron polarimeter in the hadron storage ring (HSR). The resistive wall losses are calculated from the wake potential computed in the finite-difference 3D electromagnetic code GdfidL and compared to the results obtained from the time-domain solver of another 3D electromagnetic code CST.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP019.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP021",
      "title": "BeamNetUS Pilot Year Report: Enabling access to beam test facilities394BeamNetUS is a network of facilities united in a common mission to advance accelerator research and applications of accelerator technology through improving awareness and access to these unique facilities. For its pilot campaign, the network includes facilities at Argonne National Laboratory, Brookhaven National Laboratory, Fermi National Accelerator Laboratory, Lawrence Berkeley National Laboratory, SLAC National Accelerator Laboratory, and Thomas Jefferson National Accelerator Facility. These facilities provide complementary capabilities enabling research in plasma physics, beam physics, material science, radiofrequency sources and structures, nuclear physics and electron beam irradiation. In 2025, BeamNetUS awarded time at the facilities through a competitive review process with a remit towards creating new, productive engagements. User awards were given to universities, industry and other laboratories. At NAPAC25 in a satellite meeting, we reflect on the BeamNetUS experience in its pilot year and plans for the future.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP021.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP022",
      "title": "Commissioning of a fusion collider for interstellar propulsion398A prototype colliding beam accelerator has been fabricated for the study of a fusion-based propulsion concept for interplanetary exploration. The purpose of this prototype is to demonstrate collider luminosities commensurate with the requirements of this application. Direct emission of fusion daughters generates the exhaust velocities required for spacecraft speeds in excess of 1% of the speed of light. Past attempts at nuclear fusion energy production with colliding beams have been limited by Coulomb scattering, a deficiency overcome in this collider architecture. Instead of using fusion fuels such as p/Li7 and He3/He3 capable of generating the required thrust characteristics, this prototype employs deuterons. DD fusion produces neutrons that provide a convenient luminosity detection channel. The commissioning campaign described in this paper operates the collider at a peak beam kinetic energy of 60 keV at the interaction point. Axial confinement and radial focusing are achieved electrostatically. Measured data and subsequent analysis in regard to longitudinal and transverse beam dynamics and beam lifetime are presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP022.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP023",
      "title": "Conceptual design of the Electron-Ion Collider (EIC) Electron Storage Ring (ESR) beam abort systems401Two types of beam abort mechanisms, namely, the External Abort System and the Internal Abort System for the Electron Ion Collider (EIC) Electron Storage Ring (ESR) are devised, designed and compared. Both mechanisms will be located in the Interaction region 2 (IR2). The External Abort System utilizes the ISABELLE Spectrometer tunnel to facilitate an extraction beamline and a beam dump, and the Internal Abort System generates a local orbit bump within the storage ring lattice to guide the electron beam into the beam dump. This article discusses the design of both systems, including the orbit bump design and ESR lattice modification, the resonant AC dipole design for the Internal Abort System, lattice simulation, the beam dump design and simulations using FLUKA, beampipe vacuum and impedance considerations near the beam dump.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP023.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP025",
      "title": "CST simulation and RF power for an equivalent SCL cavity at LANSCE404Superconducting LINAC (SCL) technology has been a mature option for several years. The SCL option has been studied in the past. This option has the potential to improve beam availability to the LANSCE facility users by allowing the RF system to partially migrate to a modern RF power solution such as the Spallation Neutron Source (SNS) or the European Spallation Source (ESS) klystron modulators. Due to the higher RF efficiency of the SC cavity, the use of recent advances in Solid-State Power Amplifiers (SSPA) becomes a possibility as an adequate substitute for the RF power plant. Another important aspect of the SCL option is that the partial removal of the Coupled Cavity LINAC (CCL) at β=0.78 and implementing high-gradient SC cavities provides a technically sound solution to reach beam energy of more than 1 GeV within the already existing beam tunnel, making this available for the users at LANSC",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP025.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP026",
      "title": "Current status of the electron transport line from RCS to ESR: RTE line406The electron injection system of the U.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP026.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP027",
      "title": "Derivation of the conditions under which Boussard's criterion for the microwave instability may apply410The microwave instability is typically driven by perturbations whose characteristic wavelength is much shorter than the bunch. In this case, Boussard argued that the microwave instability threshold can be found using the predictions of an infinite (coasting) beam, with the average current replaced by the peak current*. We revisit this problem, and theoretically show that if the variation of the synchrotron tune with energy can be neglected then Boussard's hypothesis holds provided 1) the longitudinal ring impedance is dominated by frequencies much shorter that the inverse bunch length; 2) the single-particle wakefield is much shorter than the bunch length, or, equivalently, the impedance is slowly varying over frequencies longer than the inverse bunch length; 3) the resulting instability has a sudden onset with growth rate of the order of the synchrotron frequency. The first two conditions imply that perturbations are localized within distances much less than the bunch length, while the last condition means that the instability experiences significant growth before the particles can make one synchrotron oscillation. While these conditions may be ``obvious'' in retrospect, we believe that the last two have not been clearly stated or widely appreciated.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP027.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP028",
      "title": "Design of flat-to-round (Vortex) beam adapter with strong space charge414We describe the design of a symmetrical skew-quadrupole triplet and associated four-quadrupole matching section for a flat-to-vortex beam transformation in a low-energy, high current electron experiment at the University of Maryland. We review the basic principles involved, from the Courant-Snyder parameters, beam (sigma) matrix, conservation of canonical angular momentum and emittances, to the evolution of the beam envelopes, with emphasis on practical aspects of the design. The initial optimization involves the use of a standard sigma matrix code that includes direct space charge effects. Refinement of the calculations are made possible by a set of moment equations that can use rotated quadrupoles and an expanded set of parameters for optimization. Additional particle-in-cell (PIC) computer simulations and preliminary results from experiments are presented in an accompanying paper.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP028.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP029",
      "title": "Design update on the transition beamline for the CEBAF Energy Upgrade418For Jefferson Lab’s 22GeV upgrade, two new permanent-magnet Fixed-Field Alternating Gradient (FFA) arcs will be integrated to serve the accelerator’s six highest-energy recirculation passes. Connecting these FFA arcs to the existing linear accelerator (linac) requires a carefully engineered transition section. The current design has two parts where the first part adiabatically matches the beam dispersion and orbit trajectories, while the second part aligns the Twiss parameters (alpha and beta functions) with those at the linac entrance. Given the tight spatial constraints and multiple matching requirements, a genetic algorithm is being explored to optimize the beam optics matching. This paper presents the current progress in developing and optimizing this transition.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP029.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP030",
      "title": "Density functional theory approach for calculating electronic band structure parameters for monte carlo simulations of photoemission422Monte Carlo simulations are a powerful tool for modeling photoemission from photocathodes, enabling the prediction of key parameters such as quantum efficiency, mean transverse energy, electron spin polarization, and photocathode response time. However, these simulations require material band structure parameters, which are not always available from experiments. This work aims to establish a reliable framework for calculating electronic band structure parameters using Density Functional Theory (DFT). Specifically, we apply this framework to investigate the effects of lattice strain and temperature on the electronic band structure and electron transport in GaAs. This approach will be further extended to explore band structure modifications in heavily p-doped semiconductors and to calculate electronic band structures of novel spin-polarized photocathode materials.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP030.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP031",
      "title": "Dynamic aperture correction for Ring Electron Cooler426The Ring Electron Cooler is one option to provide cooling to the Electron Ion Collider’s 275 GeV proton bunches. Using traditional electron cooling this racetrack shaped storage ring uses one straight section to cool the protons and the other one to enhance the radiation damping of the electrons using 2.4 T wigglers. These sections comprise the majority of the ring and are connected by short arcs. Space for sextupoles and octupoles is made in short straight sections between the wigglers. The strong wigglers and limited space for correction magnets create challenges in finding a suitable dynamic aperture correction. In this paper, we outline the challenges present in rings of this type and present a correction scheme that meets the aperture requirements of the design.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP031.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP032",
      "title": "Dynamic aperture studies at the Fermilab recycler ring429As part of the Proton Improvement Plan II (PIP-II), Fermilab aims to increase beam intensity delivered to neutrino experiments. In this context, higher intensity injection into the Recycler Ring enhances space charge effects, pushing operations closer to third-order resonances. These resonances reduce the Dynamic Aperture (DA), leading to increased beam loss. This study presents simulations of DA as a function of tune in the Recycler Ring, incorporating chaos indicators such as the Reversibility Error Method (REM) and Frequency Map Analysis (FMA). The effectiveness of existing resonance mitigation strategies is evaluated by quantifying their ability to delay DA degradation. Additionally, the study examines how space charge detuning and DA limitations dictate viable operational tune points for the Recycler Ring.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP032.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP033",
      "title": "Efficient phase space density construction via transfer operators433Optimizing accelerator lattices requires evaluating phase space densities through extended or repeated particle-in-cell simulations. These are computationally expensive due to the need to solve the equations of motion for large numbers of charged particles in prescribed and self-consistent fields. We introduce a method that significantly reduces the computational burden by constructing approximate invariant densities via a two-step transfer operator approach. The method gives practical approximations to phase-space level curves, capturing essential dynamics without extensive particle pushing. Prior work has shown how to find such curves via kernel-based level set learning*. Our method is fast, avoids kernel tuning, and integrates with existing codes, enabling rapid assessment of figures of merit in constrained optimization algorithms such as Adjoint with a Chaser, AWC**. AWC efficiently computes gradients with respect to lattice parameters while preserving moment periodicity and accounting for self-fields and collective effects. We present results demonstrating accuracy, speed-up, and trade-offs between precision and computational cost in lattice design.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP033.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP036",
      "title": "Emittance mismatching of electron injection for the Electron Storage Ring of the Electron-Ion Collider435The Electron-Ion Collider (EIC), to be constructed at Brookhaven National Laboratory, will collide polarized high-energy electron beams with polarized proton and ion beams, achieving luminosities of up to 1 × 10^34 cm^−2 s^−1 in the center-of-mass energy range of 20-140 Ge",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP036.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP037",
      "title": "Enhancing Reciprocal Space Resolution in MeV Ultrafast Electron Diffraction with Permanent Magnet Lenses439Ultrafast electron diffraction (UED) probes structural dynamics on femtosecond timescales and angstrom spatial scales. Artificial crystals are a novel experimental target for UED beams. Typically composed of lattice-mismatched atomic layers, the repeating atomic patterns in artificial crystals can have periods several nanometers in length, which produces intricate satellite features in the electron diffraction pattern. Resolving fascinating satellite diffraction peaks in a compact UED beamline requires high angular magnification. In this work, we describe the implementation of post-sample angular magnification using a pair of compact permanent magnet solenoid lenses. Configured as an objective-eyepiece pair, these lenses achieve a camera length of 50 meters, i.e., the lens system is equivalent to extending the beamline drift length by a factor 15. We demonstrate the advantages of this scheme with data that resolves satellite diffraction peaks in a heterostructure sample.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP037.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP038",
      "title": "Estimation of the wakefield resonant frequency using different simulation tools442Reliable and fast wakefield calculations are important for beam dynamics and THz generation in accelerators. We compare approaches and limitations with different available simulation tools and compare results. As an example, we analyze a cylindrical corrugated waveguide with narrower and wider radii of 5 and 6 mm, and aperture width and periodicity of 1 and 2 mm using ABCI by KEK and ANSYS HFSS simulation software. First, ABCI was used to determine the resonant frequency of the cylindrical corrugated waveguide with different lengths. The corresponding results were taken as a reference to examine the simulation method in the ANSYS HFSS environment. The eigenmode solver of ANSYS HFSS was used to determine different resonant frequencies. This was followed by examining a cylindrical corrugated waveguide that was implemented having a length of 17 mm for different conductor settings. The corresponding waveguide was fed by a plane wave having a resonant frequency that satisfies the intersection of the light line and dispersion curve of the corresponding mode. The analysis showed that the maximum loss factor was achieved at 39.20 and 40.07 GHz using ANSYS HFSS simulation data for different conductors, whereas ABCI resulted in 38.50 GHz. The talk will present the results gathered by different simulation setups implemented in ANSYS HFSS.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP038.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP040",
      "title": "Explicit symplectic representations of nonlinear dipole fringe field maps445The representation of beam transport through magnetic dipole fringe fields using effective \"thin\" maps has a long history. More recent work has extended the second-order Taylor model of Brown by providing Lie generators for symplectic maps that capture effects at higher order, expressed in terms of field integrals. These maps can be cumbersome to evaluate in an explicit symplectic form appropriate for particle tracking codes, and existing approaches often require additional approximations. We show how such maps can be recovered in a simple, explicit form as rational symplectic functions using a mixed-variable generating function approach.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP040.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP041",
      "title": "Exploring space charge mitigation with eigenpainting at the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP041.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SNS449",
      "title": "The Spallation Neutron Source uses charge exchange injection of 1.3 GeV, H- ions to accumulate roughly 2x10E protons per pulse in the accumulator ring. This is achieved using a flexible painting system capable of controlling all four transverse coordinates of injected beam over the 1ms injection cycle. Recently we demonstrated injection of an ~800 MeV beam into a single non-planar mode in the SNS ring, which we call eigenpainting. This poster will outline future plans for exploring the space charge dynamics of beams prepared by eigenpainting in the SNS ring, including comparison of hollow, gaussian, and uniformly painted beams.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-SNS449",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUP042",
      "title": "Extracting symplectic maps for space charge dominated beams453Symplecticity of transfer maps is important for reliable evaluation of space-charge dominated beams in accelerators. Unfortunately, most simulation codes that include collective effects, such as space charge, do not use canonical phase-space variables and therefore are not symplectic in the presence of electromagnetic fields. In this paper, we present a numerical method to extract symplectic transfer maps using particle tracking simulation code IMPACT-T for space-charge dominated beams. We demonstrate this method by obtaining symplectic transfer maps in the photo-injector (113 MHz SRF gun) section of the Coherent electron Cooling (CeC) Proof of Principle (POP) experiment.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP042.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP046",
      "title": "Fast spin tracking using a Magnus expansion457Spin motion in particle accelerators obeys the Thomas-Bargmann-Michel-Telegdi (T-BMT) equation. Due to the structure of the T-BMT equation, the spin-transfer quaternion of a magnet is generally a nonlinear function of the entrance coordinates even if the phase-space motion is linear. This nonlinear function can be written as a Dyson expansion, for example as employed in the program SPRINT, which normalized the first-order expansion of the spin-transfer quaternion. Alternatively, this nonlinear function can be written as a Magnus expansion. This paper points out that in cases where the phase-space coordinates change little, as is generally the case for accelerator elements, the Magnus expansion is a much more appropriate method to describe the nonlinear spin motion because this expansion terminates after the first term when the phase-space coordinates are constant. We will demonstrate, with several examples, that an approximation based on the Magnus expansion leads to very good agreement with time-consuming numerical integration, and to significantly better agreement than obtained with historical codes like SPRINT.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP046.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP048",
      "title": "Generation of low-emittance bunches with selective collimation at the Argonne Wakefield Accelerator461The Argonne Wakefield Accelerator (AWA) facility’s drive-beam linear accelerator can generate electron bunches at a wide range of charge - from 100 pC to 100 n",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP048.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP049",
      "title": "High DC injection voltage photocathode e-beam sources464Laser switched photocathode sources are typically used to produce trains of polarized electron bunches for high performance accelerators. This paper consid-ers two high brightness, high charge-per-bunch, e-beam injector approaches that utilize laser gated cath-odes followed by DC beam acceleration sections com-prised of 1-3 grading electrodes. The use of grading electrodes provides reliable high voltage standoff between the plates themselves and ground. In the rectilinear beam source case in particular, we found that the uniformity of the emitted current density can have a major effect on final beam emittance and brightness.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP049.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP050",
      "title": "Impact of electron beam size ripple on proton emittance growth for",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP050.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "EIC467",
      "title": "The Electron-Ion Collider (EIC) employs a flat hadron beam to achieve high luminosity, with the proton beam's vertical emittance being an order of magnitude smaller than its horizontal one. The smaller vertical emittance is sensitive to external noise. This study examines electron beam size ripple, a narrow-band noise centered around $60~\\mathrm{Hz}$ in the U",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-EIC467",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUP051",
      "title": "Impedance and wakefield studies of the EIC RCS 591 MHz five-cell cavity471The Electron-Ion Collider (EIC) is a next-generation accelerator complex designed to enable high-luminosity collisions between highly polarized electrons and light ions (e.g., He-3). A central component of its Electron Injection System (EIS) is the Rapid Cycling Synchrotron (RCS), which accelerates a single 28 nC electron bunch from 750 MeV to 5, 10, or 18 GeV using an array of 591 MHz five-cell superconducting RF (SRF) cavities—eight at the current design stage. To ensure stable acceleration of high-charge bunches, we conducted detailed impedance and wakefield studies of the SRF cavity structure using both frequency- and time-domain methods. Wakefield solvers (ECHO3D, ECHO1D, CST), eigenmode analysis, and multi-particle tracking with ELEGANT were employed to evaluate longitudinal and transverse impedance effects and to determine instability thresholds. These studies provide critical input for the cavity design and operating parameters required to preserve beam quality and stability in the RCS.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP051.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP052",
      "title": "Implementation of adjoint sensitivity analysis in",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP052.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WARP475",
      "title": "The design of accelerator lattices involves evaluating and optimizing Figures of Merit (FoMs) that characterize a beam’s properties. These properties—hence the FoMs—depend on the many parameters that describe a lattice, including the strengths, locations, and possible misalignments of focusing elements. Often what is required is the gradient of the FoM with respect to each of the parameters. For systems that require numerical simulation, a naïve computation of a gradient requires one simulation for the “base case”, plus one additional simulation for each parameter of interest—a daunting effort in the case of computationally demanding simulations with many parameters. Adjoint techniques allow one to extract gradient information from one base-case simulation plus an additional one or two carefully prepared simulations.* We demonstrate these techniques using the accelerator simulation code WARP, and we present our proof-of-concept results using several different FoMs as the basis for adjoint analyses of a simple beamline with multiple parameters.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-WARP475",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUP053",
      "title": "Instability threshold measurements in the IOTA ring at Fermilab479Nonlinear focusing elements enhance the stability of particle beams in high-energy colliders via Landau Damping, a phenomenon that acts through the tune spread these elements introduce. This experiment at Fermilab's Integrable Optics Test Accelerator (IOTA) aims to investigate the influence of nonlinear focusing elements on transverse beam stability by employing a novel method to directly measure the strength of Landau Damping. This method employs an active transverse feedback system as a controlled source of impedance to induce a coherent beam instability. The beam’s resulting growth rate and transverse feedback parameters can then be used to directly measure the stability diagram, a threshold which maps the system's stability conditions. A proof-of-principle experiment of this measurement method was first explored at the LHC, where the experiment at IOTA aims to map out the entirety of the stability diagram and to obtain the beam distribution function from the stability diagram, a procedure never done before that would enable one to obtain the beam distribution tails. Here we present the initial results of stability diagram data analysis, simulation results, and plans for further investigation.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP053.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP054",
      "title": "Interactions between the circulating beam and the injection foil at the Proton Storage Ring of LANSCE483At the Los Alamos Neutron Science Center (LANSCE), the injection system of the Proton Storage Ring (PSR) utilizes charge exchange via a stripping foil to convert H⁻ ions into H⁺. While beam losses caused by partially stripped neutral hydrogen atoms are a primary concern, interactions between the circulating beam and the injection foil also play a significant role in overall beam loss. Each stored proton interacts with the foil 30 times on average. As a result, large-angle scattering is a dominant cause of beam losses in beam dynamics simulations. To mitigate these effects, a set of bump magnets is employed to gradually move the closed orbit away from the foil during the accumulation process. In this work, we first compare various foil scattering algorithms used in ring simulations against results from Monte Carlo (MC) codes. We then quantify the impacts of different bumping schemes, assess uncertainties related to injection offsets, generate interaction 2d-distribution on the foil for heat load simulations, and evaluate the effects of different injected beam distributions.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP054.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP055",
      "title": "IOTA experiment for proton pulse compression at extreme space-charge486The longitudinal compression of intense proton bunches with strong space-charge force is an essential component of a proton driver for a muon collider. We propose a proton bunch compression experiment at the Integrable Optics Test Accelerator (IOTA) storage ring at Fermilab to explore optimal radio frequency (RF) cavity and lattice configurations. IOTA is a compact fixed-energy storage ring dedicated to beam physics R&D that can circulate a 2.5-MeV proton beam with extreme space-charge. Using ImpactX and its 3D space-charge solver, simulations indicate that bunch length can be rapidly reduced by a factor of at least two, without appreciable degradation in transverse beam quality, even under strong space-charge conditions. However, longitudinal defocusing presents a large effect in short-pulsed proton beams, and the optimization of bunch compression under such conditions is discussed.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP055.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP056",
      "title": "JuTrack, a Julia-based auto-differentiable accelerator simulation code for advanced dynamics, scientific machine learning and optimization490JuTrack is a high-performance accelerator modeling and particle tracking package developed in the Julia programming language. With compiler-level automatic differentiation (AD), JuTrack enables fast and precise derivative computations for arbitrary differentiable simulation functions. It supports efficient modeling of complex collective effects such as space-charge forces, wakefields, and beam-beam interactions. Beyond conventional tracking simulations, JuTrack also incorporates a machine learning–based module for self-field modeling and convenience interface that brings data-driven and physics-driven model together. In this paper, we demonstrate the capability and performance of JuTrack through a broad set of beam dynamics applications and optimization across various accelerator types, including a synchrotron light source, a heavy-ion linear accelerator, and the colliders. Built on Julia’s high-performance architecture and user-friendly syntax, JuTrack provides a powerful tool for beam dynamics studies and accelerator design optimization.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP056.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP057",
      "title": "LANSCE beam transport model enhancement and validation493At the Los Alamos Neutron Science Center (LANSCE), accurate beam transport modeling is essential to understand the nature of beam instabilities and losses. The model analysis enables significant improvement in beam transport tuning. It is the key element in ensuring the beam envelope remains constrained and that the bunch structure is preserved as it traverses the distance from the 800-MeV Linac to the target stations downstream. Historically, all the high-energy beamlines (HEBT) have been simulated using the TRANSPORT code. We are developing enhanced beamline models in modern accelerator physics codes such as MAD-X or Elegant, which enable more detailed particle tracking and include some space-charge effects. These models may help us better understand the beam parameters during transport to the targets. In this report, we present our simulation models and, where applicable, compare them with experimental beam diagnostics data.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP057.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP059",
      "title": "Lattice design for Low Energy Cooling in EIC HSR-IR2496Insertion Region at two o'clock (IR2) of the Relativistic Heavy Ion Collider will be modified to provide effective cooling for the Electron-Ion Collider (EIC). This paper summarizes the update of the HSR-IR2 lattice design to meet the evolving requirements of the EI",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP059.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP060",
      "title": "Lattice refinements for nonlinear integrable optics in",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP060.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "IOTA499",
      "title": "Nonlinear integrable optics of the type proposed by Danilov and Nagaitsev place strict constraints on the lattice parameters in the matching section outside of the nonlinear insert. In particular, the effects of energy spread in the beam have significant effects on the stability of the system. Typical chromatic compensation using sextupoles has significant perturbative effects on the dynamics but is operationally necessary to suppress fast losses. Fast decoherence of kicked beam measurements limits the available signal for studies. Refinements to the IOTA lattice parameters based on this experience with electron beam operation are presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-IOTA499",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUP061",
      "title": "Linac to BAR/RCS transfer line design for EIC electron injection system502A transfer line has been designed for the Electron-Ion Collider (EIC) to transport electron bunches from the linac to the Rapid Cycling Synchrotron (RCS). In its initial operational stage, the line accommodates 1 nC electron bunches directly from the linac. To support a future upgrade involving a Beam Accumulator Ring (BAR), which will stack individual bunches to form high-charge 28 nC bunches, the design incorporates two switching dipoles enabling injection into and extraction from the BA",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP061.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP062",
      "title": "Matching the beam from AGS to the EIC Hadron Storage Ring with excellent emittance preservation505The Electron-Ion Collider (EIC), a next-generation accelerator facility, is being jointly developed by Brookhaven National Laboratory (BNL) and Jefferson Lab (JLab), and will be constructed at BN",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP062.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP063",
      "title": "Measurements and simulations of intrabeam scattering effects at NSLS-II508In this study, we present the latest measurements of intrabeam scattering (IBS) effects at NSLS-II and compare them with particle tracking simulations using ELEGAN",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP063.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP065",
      "title": "Measurements of the beam longitudinal properties in the Fermilab Linac511The Fermilab Linac delivers 400$\\,$MeV, 25$\\,$mA H$^-$ beam to a rapid cycling synchrotron called the Booster. Parameters of the Linac beam affect Booster performance and therefore quantifying them is important. The longitudinal bunch parameters are reconstructed using a Bunch Shape Monitor (BSM) installed in the middle of the Linac. For that, the bunch length is measured as a function of the phase of an upstream cavity and fitted to simulations. The cavity gradient and its phase with respect to the beam are recovered from readings of Beam Position Monitors. Since the cavity provides a significant transverse defocusing, the BSM measurements are correlated with transverse beam size measurements by a wire scanner. Simulations connect these three types of measurements, allowing to deduce the longitudinal emittance and Courant-Snyder parameters.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP065.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP066",
      "title": "Minimizing dispersion through resonant extraction for BNL's",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP066.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "NSRL515",
      "title": "Simulations, analysis, and measurements are performed on the BNL Booster’s third integer resonance extraction to the NSRL line, which uses a constant optics slow extraction method. In this method, ring dipoles and quadrupoles are changed synchronously for a coasting beam, which aids in maintaining a fixed separatrix orientation through the spill. Simulations show that the outgoing beam has a very small dispersion, independent of the periodic dispersion value at the septum. We show using a first-order normal form approximation that transforms to the Kobayashi Hamiltonian, how the dynamics of such a spill lead to a dispersion-free outgoing beam, which is critical to the uniformity requirements of the NSR",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-NSRL515",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUP067",
      "title": "Mitigation of coherent synchrotron radiation by bunch profile optimization and shielding518The mitigation of the effects of coherent synchrotron radiation (CSR) is a key challenge in generating high brightness beams. Shielding by parallel plates installed in the dipole magnet vacuum chambers shows promise, both in simulation and experiment* at small shielding gap separations. In this work, we consider a beam traversing a chicane with larger cm-scale separations on each dipole, necessitating the combined use of longitudinal profile shaping and shielding to reduce emittance growth. We model the radiated CSR using a 3D integrated Green's function technique that accounts for the complete 6D phase space of the bunch along with image charges to model shielding. This method is used in conjunction with a genetic algorithm to optimize the longitudinal current profile. Our results indicate current profiles that differ to results derived without shielding** and allow for effective mitigation of emittance growth at cm-scale gaps. We will present details of the simulation and optimization method along with future plans, including ongoing experiments at the Argonne Wakefield Accelerator as part of a collaboration that seeks to investigate the effects of CSR on beams.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP067.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP068",
      "title": "Mu2e resonant extraction regulation system simulation in delivery ring522Mu2e is an upcoming experiment at Fermilab that relies on the slowly extracted 8 GeV proton beam from the Delivery Ring. The experiment imposes strong requirements on the spill uniformity. To address these requirements, the fast spill regulations system is being developed and commissioned. To inform this development and optimize the system performance we are carrying out the detailed simulations of the regulation process. The simulation includes the effect of six harmonic sextupoles that excite the third-integer resonance and three fast ramping quadrupoles that drive the horizontal tune to 29/3. The components of spill regulation system are designed to mitigate long-term drifts in the beam, ensuring stable operation over extended timescales, as well as addresses rapid variations within single spill. In this study, we review the regulation system design, simulation of the slow regulation, and the fast regulation PID regulation to curtail random variations in the extraction rate that could occur within a single spill.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP068.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP069",
      "title": "Multi-objective optimization of Strong Hadron Cooler Energy Recovery Linac injector525The Strong Hadron Cooler (SHC) proposed for the Electron-Ion Collider (EIC) requires high-current, low-emittance electron bunches with minimal energy spread. The Energy Recovery Linac (ERL) injector plays a critical role in shaping the beam before acceleration. We present a multi-objective optimization study of the SHC ERL injector and merger using space charge tracking in Bmad and parallel genetic algorithm. The optimized configuration reduces the normalized transverse emittance by 62% and energy spread by 85% from the original configuration.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP069.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP070",
      "title": "Multiple interaction points in Ghost collisions529The Ghost Collider makes use of unique “ghost” bunches, which are electrically neutral combinations of electrons and positrons within the same RF bucket, eliminates the beam-beam effects typically present at the interaction point (IP) in conventional colliders. This allows for the novel possibility of placing multiple interaction regions in series, achieving additive luminosity without introducing significant disruption. However, to get higher luminosity, the beta functions at the IP reaches millimeter scale, which in turn adds significant chromatic contribution to the collider. Correcting these chromatic effects is essential to maintain beam stability and ensure high luminosity during collider operation. By carefully adjusting the phase advance between two IRs that are placed in series, it becomes possible to cancel chromaticity globally, enabling stable collider operation while preserving high luminosity. In this paper we discuss the design of such IR/IRs to be used in a ghost collider.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP070.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP071",
      "title": "New measurement techniques for gear-changing research using DESIREE532In this work we cover some of the newer techniques developed to measure the effects of a gear changing system maintained in DESIREE at Stockholm University. Gear-changing is a collider synchronization method where two rings with different harmonic numbers in them maintain collisions through different velocities, pathlengths or a combination of the two. This system has been demonstrated using the low energy ion collider DESIREE at Stockholm university. We have not only continued our previous methods of studying the beam using a repeating pattern technique where one bucket in each ring is intentionally left empty, but we now also use recently installed pickups outside of the merger region to study the beams separately while they collide.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP071.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP073",
      "title": "Optical properties of wigglers with high field-to-energy ratio535One of the options to bring electron cooling to high energies is to employ an electron storage ring, which utilizes damping wigglers to counteract emittance growth of electron bunches used to cool hadrons. An example of such a cooler is the Ring Electron Cooler (REC) that can find potential future applications in Electron Ion Collider. The REC is designed to operate at 150 MeV and requires wigglers with peak field of 2.4",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP073.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP074",
      "title": "Optics reconstruction in the SCL section of the FNAL Linac539The Side-Coupled Linac (SCL) section of the FNAL linac accelerates the beam from 116 MeV to 401.5 MeV, operating at 22-24 mA beam current. Transverse focusing is performed by 32 quadrupoles, and the beam orbit is guided by 19 dipole correctors and measured by 29 BPMs. The bunch length is measured in a single location by a Bunch Shape Monitor (BSM). This paper presents a three-step reconstruction of the machine optics. First, the transverse and longitudinal Twiss parameters at the start of the SCL section are determined using quadrupole scans and BSM measurements at different settings of an upstream cavity. Second, the quadrupole calibrations are adjusted based on differential-trajectory measurements. Finally, the beam is propagated along the SCL linac using the code TraceWin. A comparison between TraceWin simulations and the beam envelope measured by the 12 wire scanners of the SCL linac was performed. Transverse and longitudinal beam parameters at the entrance and exit of the SCL section will be reported.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP074.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP075",
      "title": "Optimizing 4D emittance measurements using the pinhole scan technique543Accurate measurement of electron beam emittance is essential for optimizing high-brightness electron sources. The Pinhole Scan Technique measures the 4D phase space and hence the emittance by measuring the beam profile after clipping the beam using a pinhole followed by a drift section and then scanning the beam over the pinhole. This technique has been implemented in low (< 200 keV) beamlines at both Cornell university and Arizona State University. However, the technique poses several practical challenges. In this work, we analyze and address key issues affecting the 4D phase space and emittance measurements using this technique. We identify and investigate sources of inaccuracies like the pinhole aspect ratio, beam divergence, position-momentum correlations in the phase space, and the point-spread-function of the detector and suggest techniques to minimize them. Our findings offer a pathway to more accurate 4D phase space characterization in advanced electron beam systems.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP075.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP077",
      "title": "Phase variation for snake matching in the EIC's",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP077.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "HSR547",
      "title": "The Hadron Storage Ring of the Electron-Ion Collider will feature 6 Siberian snakes placed at the start of each arc to coherently cancel spin precession from diametrically opposite arcs in the ring. To avoid spin-orbital resonances, the alternating sum of the rotation axes of all snakes is 90 degrees, ensuring the closed-orbit spin tune is ½ and sufficiently far away from betatron tunes and integer tunes. This choice does not account for amplitude-dependent spin tune (ADST) shift, which introduces high-order spin orbit resonances in the vicinity of strong first-order resonances. By varying betatron phase advances across each of the 6 arcs, we minimize the strength of first-order spin-orbit resonances as well as ADST shift. In the case of uncooled helium-3, we find it is necessary to minimally vary the vertical orbital tune as well but are able to completely avoid depolarization throughout the ramp with time-dependent phase advances.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-HSR547",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUP078",
      "title": "First observations of dispersive shock waves from the KdV equation in an electron beam550We present the first experimental observation of dispersive shock waves (DSWs) in an electron beam. Using the University of Maryland Electron Ring (UMER), a 10 keV electron beam was perturbed with a localized beam velocity dip. The resulting current profiles evolve into oscillatory structures consistent with dispersive shock behavior governed by the Korteweg–de Vries (KdV) equation. These results are predicted by particle-in-cell simulations using the WARP code. The observed dynamics open new avenues for studying nonlinear longitudinal phenomena in intense beam systems.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP078.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP080",
      "title": "Preliminary study of space charge and beam-beam interplay in a collider ring554Hadron Collider Rings offer unprecedented opportunities to address fundamental scientific questions in particle and nuclear physics. To achieve these ambitious goals, the colliders must deliver exceptionally high levels of luminosity, hence require high intensity hadron beam in the ring, which leads to high beam-beam parameter, as well as comparable space charge effects. This study focuses on nonlinear effects that impact the beam dynamics within the hadron accelerator ring, including weak-strong beam-beam interactions and their interplay with space charge effects. Accurately predicting these non-linearities, particularly resonances arising during multi-turn acceleration, is critical for long beam lifetime and optimal accelerator performance. This work presents an initial attempt to develop an optimized approach that integrates space charge effects across the entire ring length while incorporating localized beam-beam interactions at specific interaction points.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP080.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP081",
      "title": "Progress toward dual-pulse operation at the Proton Storage Ring of LANSCE558Significant progress has been made in both hardware development and simulation capability to shorten the proton bunch width delivered to the Lujan Center at LANSCE via the Proton Storage Ring (PSR). We have successfully demonstrated operation of the PSR RF buncher at 5.6 MHz, doubled from the standard running condition, to accumulate the shorter beam pulse. A quick switch between two modes is under consideration. To extract the beam properly, a prototype kicker test stand has been established, and the measurement of the pulse width, rise time, and charging time will be demonstrated. On the simulation front, beam dynamics models have been refined using both ELEGANT and pyORBIT codes to optimize dual-pulse stacking scenarios. We have performed detailed studies of longitudinal phase space evolution, space charge mitigation, and bunch separation fidelity, which guide ongoing design efforts and beamline integration. These advancements will be the foundation for future development of shorter pulses for the Lujan Center.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP081.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP082",
      "title": "Lattice design of a pulsed synchrotron chain for a muon collider sited at Fermilab562We present preliminary lattices for a rapid cycling synchrotron (RCS) chain based on a bottom up design for a 10 TeV parton center-of-momentum (pCM) muon collider sited at Fermilab. The smallest RCS rings in this lattice are 6.28 km in circumference and the largest RCS ring fitting fully within the Fermilab site is 15.5 km. To reach 5 TeV per beam, a single tunnel containing up to two rings is allowed to exceed the 15.5 km limit. Each ring is either a conventional RCS or a hybrid RCS. A conventional RCS relies on only iron dominated, ramped field magnets while a hybrid RCS relies on a combination of interleaved ramped field and superconducting fixed field magnets to achieve higher average magnetic fields while maintaining the high ramp rates achievable with iron dominated magnets. A pair of 6.28 km RCS rings and a 15.5 km RCS ring accelerate beams from 63 GeV to 1.54 Te",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP082.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP082",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP084",
      "title": "Recent progresses regarding enclosed RF cavities for future muon collider cooling channel566The muon collider (MuC) holds strong potential for reaching the 10 TeV energy frontier but introduces several technical challenges. Ionization cooling is essential to reduce beam emittance and achieve required luminosities. As muons lose energy in absorbers, normal-conducting RF cavities restore it. However, strong magnetic fields—needed for beam focusing—increase the risk of RF cavity breakdowns. Thin beam windows are used to reduce breakdown probability and improve shunt impedance. In this paper, we present some recent studies on these cavities, including: 1) evaluating emittance growth due to particle scattering in the beam windows made of Be and Al by GEANT4, 2) calculating the beam loading effect in the presence of the beam windows with CST wakeifeld solver and Particle-In-Cell solver, 3) deriving the breakdown thresholds for different cavity materials in strong B fields based on a thermal-mechanical model.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP084.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP086",
      "title": "Simulations of CSR and LSC induced microbunching in the presence of a laser heater570We present a study of microbunching instability in the FACET-II linac, in which the amplification and damping mechanisms are analyzed separately. Our simulations investigate the gain induced by Longitudinal Space Charge (LSC) and, critically, the damping caused by nonlinear terms in the beam transport transfer map. We show theoretically and through simulation that these nonlinear effects can produce damping several orders of magnitude stronger than predicted by linear theory. Experimental evidence validates these findings. A quadrupole scan performed in the FACET-II dogleg reveals that an interaction between coherent betatron oscillations and transfer map nonlinearities shifts the point of minimal damping away from the expected linear condition of $R_{51}=0$. The strong agreement between our simulations and the experimental data demonstrate that a thorough understanding of nonlinear dynamics is essential for high-brightness beam transport.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP086.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP087",
      "title": "Start-to-end simulations of the LAMP accelerator front-end574The LANSCE Accelerator Modernization Project (LAMP) plans to replace the two existing 750-keV Cockcroft Waltons by a single radio-frequency quadrupole (RFQ), and to install a new 100-MeV drift-tube linac (DTL). LAMP will simultaneously produce H+ and H- beams with different timing patterns to serve multiple experimental facilities. A low energy beam transport (LEBT) is designed to transport H+ and H- beams from the ion sources into the 201.25 MHz RFQ, where the beams are accelerated to 3 MeV. A medium energy beam transport (MEBT) is designed to transport the beam from the RFQ to the DT",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP087.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP088",
      "title": "Passive higher-harmonic RF cavity simulations for bunch lengthening in the NSLSII-U577In this study, we present a comparative analysis of passive higher-harmonic cavity (HHC) simulations with beam loading compensation using the particle tracking codes ELEGANT and SPAC",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP088.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP090",
      "title": "Single-bunch instabilities driven by space charge during low-energy cooling at injection in the EIC Hadron storage ring581This paper presents a simulation-based study of single-bunch dynamics at the injection energy of 23.8 GeV for protons in the EIC hadron storage ring, focusing on the impact of space-charge–driven instabilities. The analysis demonstrates that at this energy, the proton bunch experiences significant transverse space-charge forces, which can reduce the stability margin in the presence of the geometric and resistive wall impedance. Various collective effects were considered, with particular attention to the nonlinear nature of the transverse space charge. To stabilize the beam, high chromaticity and octupoles were introduced and their effects analyzed using the ELEGANT code. The results provide a quantitative assessment of the stability thresholds and offer guidance for the machine design and operational strategy at injection.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP090.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP091",
      "title": "Space charge studies on strong hadron cooler energy recovery linac584An Energy Recovery Linac (ERL) based cooler, using Coherent electron Cooling (CeC) is being designed for cooling hadron beams of the Electron-Ion Collider (EIC). The ERL design utilizes highcurrent, high-brightness electron beams with low emittance and a uniform longitudinal distribution for efficient hadron cooling. This is designed to operate in two modes to accommodate cooling requirements for hadron bunches at 100 GeV and 275 GeV, each with an average current of 100 mA and 1 nC bunch charge. With these parameters, the space charge effects become significant in this ERL design due to the low beam energy and high beam current. In this paper, we discuss strategies for including space charge effects in the optics design and implementation of an interface for space charge dominated and non-dominated regions of this ERL lattice.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP091.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP092",
      "title": "Start-to-end simulations of nanometer-emittance beam transport through an emittance exchange beamline588We present start-to-end simulation study of the transport of a few pico-Coulomb, nanometer-emittance beam through an emittance exchange (EEX) beamline. EEX with nanometer-emittance beams has potential to enable research opportunities utilizing tunable and high quality attosecond bunches and nanometer-scale longitudinal bunch trains. To account future possibility of experimental demonstrations, the simulation implemented existing EEX beamline at Argonne Wakefield Accelerator (AWA) facility. Simulation was conducted using General Particle Tracer (GPT) code.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP092.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP093",
      "title": "Start-to-end simulation study for transverse wiggler-based manipulation experiment592We present a simulation study to support the planning of experimental demonstrations of transverse wiggler-based correlation control. While previous simulations confirmed the feasibility of this approach, they did not incorporate realistic field maps of the transverse wigglers. In addition, the impact of various jitter and error sources—key concerns for experimental implementation—has not been analyzed. In this study, wiggler fields are generated through magnetostatic simulations and incorporated into start-to-end particle tracking simulations. The phase space responses to different jitter and error sources are also evaluated.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP093.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP094",
      "title": "Status of conceptual horizontal splitter design for FFA@CEBAF energy upgrade596Jefferson Lab’s Continuous Electron Beam Accelerator Facility (CEBAF) is currently investigating the feasibility of upgrading its maximum operating energy using Fixed-Field Alternating-gradient (FFA) recirculating arcs to increase the total number of recirculations the beam through the pair of LINACs. These FFA arcs will be composed of permanent magnets, with small Panofsky-style multipole correctors. Horizontal splitters are needed to control the beam parameters through these FFA arcs. The geometrical and physical constraints, as well as the beam matching requirements are very restrictive, complicating the design. This work will show the current status of the most mature design, which includes matching solutions, as well as options for extraction of the beam.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP094.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP097",
      "title": "The implementation of adaptive step size Runge Kutta integrator in Zgoubi600The Zgoubi simulation code for beam and spin dynamics employs a numerical method based on Taylor series to integrate the Lorentz and Thomas-BMT equations, optimizing computational efficiency while ensuring high accuracy and robust preservation of motion invariants. In this work, we developed and implemented an adaptive step-size Runge-Kutta (RK) integrator into Zgoubi to tackle growing computational demands in accelerator physics simulations. This new integrator complements Zgoubi's default solver, offering users the flexibility to choose between integration methods based on specific simulation requirements. We demonstrated that the adaptive step-size RK integrator achieves the necessary accuracy and performance for integrating the Lorentz and Thomas-BMT equations effectively. A key advantage of Zgoubi lies in its wide optical elements library, featuring over 60 accelerator components and variants, which the new adaptive step-size RK integrator can seamlessly utilize. Developed and rigorously tested over decades across numerous projects, this library provides a high degree of confidence in the code’s reliability. The same advantage holds about ancillary computations such as synchrotron radiation, space charge, decay in flight, etc. The implementation of the adaptive step-size RK integrator supports Zgoubi’s adaptability, enabling simulations of complex beam and spin dynamics with a trusted and well-established computational framework.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP097.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP097",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP098",
      "title": "Third integer resonant extraction transit time simulation studies604In this work, we present the investigation of transit time of particles in the non-linear third-integer resonant extraction process. Transit time is defined as the number of turns a particle takes to get extracted once it is in the unstable region in the phase space, i.e., outside the triangular separatrix in case of third-integer resonance. The study of transit time is important because transit time directly contributes to the beam response time during resonant extraction and thus knowing it apriori would be practically useful in designing of the extraction system. In this work, we shall investigate the analytical derivation of the transit time of particles (to the first order Kobayashi Hamiltonian) in different parts of the phase space distribution and compare against the analytical results. We also compare the simulation result of the transit time of particles (with higher statistics) for the static as well as dynamic extraction conditions cases, particularly in the context of resonant extraction parameters for Mu2e experiment at Fermilab.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP098.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP098",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP099",
      "title": "Timing of ultrafast electron and laser pulses with narrowband THz interferometry for ultrafast electron diffraction607Ultimately, accurate time of arrival determination of laser pump and electron beam probe will determine the temporal resolution of the SLAC MeV-Ultrafast Electron Diffraction* (MeV-UED) instrument, and therefore methods to achieve this at femto-second scales is an ultrafast science enabler. Interferometry of THz based e-beam and pump laser THz signals is a natural path towards this goal. As a first step, a detection scheme will be developed in a lab using laser pulses. The second step involves extracting the electron beam signal from a 100 GHz accelerating structure. Subsequently, both pump and electron beam signals are combined, filtered, amplified, and a temporal analysis can be performed. This proposal is for experimental detection and characterization of such signals, which arises from electron beam wakefield excitation of electromagnetic fields in a 100/200 GHz accelerating structure combined with a pump derived signal.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP099.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP099",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP100",
      "title": "Tolerances of RF phase and voltage noises with beam-beam interaction in the Electron-Ion Collider610The Electron-Ion Collider (EIC), to be constructed at Brookhaven National Laboratory, will collide polarized high-energy electron beams with polarized proton and ion beams, achieving luminosities of up to 1 × 10^34 cm^−2 s^−1 in the center-of-mass energy range of 20–140 Ge",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP100.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP100",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP101",
      "title": "Towards differentiable beam dynamics modeling in BLAST/ImpactX614Differentiable simulations are in demand in accelerator physics, demonstrating order-of-magnitude improvements for complex tasks such as many-parameter optimization for accelerator working points and reconstruction of hard-to-measure quantities. At its core, a differentiable simulation does not only solve a forward problem, but additionally provides gradients of output parameters (e.g. beam parameters) with respect to input parameters (e.g. beamline or source parameters). How to effectively program large dynamic simulations differentiably is still an open question, but there is general consensus that a “single-source” approach aided by automatic differentiation (AD) is desirable. Addressing this, there are a) emerging domain-specific languages in machine learning that are intrinsically differentiable, and b) highly-performing & scalable, general-purpose languages like ISO C++ of existing codes. The challenge of approach a) is syntax specialization, which can limit ease of implementation & performance for physics algorithms, while b) requires additional work for A",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP101.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP101",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP102",
      "title": "Transverse beam dynamics studies in the FRIB accelerating cryomodules618The accelerating segments in the Facility for Rare Isotope Beams (FRIB) linac contain superconducting RF cavities accelerating the beam and superconducting solenoids providing transverse focusing. We have studied the transverse emittance growth in the post-stripper linear accelerating segment of the FRIB linac. To understand the cause of the emittance growth we employ a macroparticle tracking code to simulate 3D beam dynamics in this segment of the linac. The model is being developed and validated by beam measurements. The measurements are focused on the response of the transverse beam position along the segment after the beam is kicked by dipole steering magnets at the entrance to this segment. The results of the studies with various beam species and energies will be presented.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP102.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP102",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUP104",
      "title": "Vertical emittance growth from IBS diffusion via beam-beam coupling in the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/TUP104.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-TUP104",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "EIC621",
      "title": "We investigate vertical emittance growth in the Electron-Ion Collider (EIC) arising from intrabeam scattering (IBS) diffusion through beam-beam interactions. Using weak-strong simulations, we demonstrate that when horizontal noise is introduced, vertical emittance increases even in the absence of direct vertical diffusion. This behavior is attributed to resonance streaming around the synchro-betatron resonance $2\\nu_x-2\\nu_y+p\\nu_z=0$, which enables unidirectional emittance transfer from the horizontal to the vertical plane. We further show that horizontal cooling alone cannot suppress the vertical growth, confirming that dedicated vertical cooling is essential for preserving the flat beam profile in high-luminosity EIC operation.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-EIC621",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 87,
  "scrape_time": "2025-11-04 09:15:11"
}