{
  "session_info": {
    "id": "MOP",
    "name": "MOP - Monday Poster Session",
    "url": "https://meow.elettra.eu/97/session/1167-mop/index.html"
  },
  "papers": [
    {
      "paper_id": "MOP001",
      "title": "Accelerator drift compensation via a modified MG-GPO Algorithm34Performance drift over long periods of operation due to changes in machines settings or the environment has been a longstanding problem for particle accelerators. Algorithms which are capable of tuning machine settings while keeping the performance within a desired threshold can be used to compensate for such drifts. We have developed a modified version of the Multi-Generation Gaussian Process Optimizer (MG-GPO) which is capable of tuning accelerator settings during user operation. The modified algorithm uses Gaussian Process regression to predict the performance of potential trial settings and removes ones with a high probability of giving too poor of a performance before selection for evaluation on the machine. The modified MG-GPO has been tested on analytic functions and applied to the SPEAR3 kicker-bump matching problem as a proof of concept. It is expected that the modified MG-GPO will be applied to maintain optimal trajectory of the beam injected into the SPEAR3 storage ring.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP001.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP002",
      "title": "Advancing accelerator virtual beam diagnostics through Latent Evolution Modeling: An integrated solution to forward, inverse, tuning, and UQ problems38Virtual beam diagnostics relies on computationally intensive beam dynamics simulations where high-dimensional charged particle beams evolve through the accelerator. We propose Latent Evolution Model (LEM), a hybrid machine learning framework with an autoencoder that projects high-dimensional phase spaces into lower-dimensional representations, coupled with transformers to learn temporal dynamics in the latent space. This approach provides a common foundational framework addressing multiple interconnected challenges in beam diagnostics. For *forward modeling*, a Conditional Variational Autoencoder (CVAE) encodes 15 unique projections of the 6D phase space into a latent representation, while a transformer predicts downstream latent states from upstream inputs. For *inverse problems*, we address two distinct challenges: (a) predicting upstream phase spaces from downstream observations by utilizing the pretrained CVAE with transformers trained on reversed temporal sequences, and (b) estimating RF settings from the latent space of the trained LEM using a dedicated dense neural network that maps latent representations to RF parameters. For *tuning problems*, we leverage the trained LEM and RF estimator within a Bayesian optimization framework to determine optimal RF settings that minimize beam loss. This paper summarizes our recent efforts and demonstrates how this unified approach effectively addresses these traditionally separate challenges.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP002.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP003",
      "title": "AI-ready control infrastructure for cyclotron systems using GPU-accelerated Python GUIs and LabVIEW over ZeroMQ42We present a modular, AI-ready control and monitoring infrastructure developed for the 76-inch isochronous cyclotron at the Crocker Nuclear Laboratory, University of California, Davis. The system combines a GPU-accelerated Python GUI engine on a high-performance Linux workstation with a LabVIEW-based supervisory platform for real-time control and data acquisition. Communication between platforms is handled via ZeroMQ, enabling low-latency, asynchronous data exchange. Benchmark results show end-to-end response times below 10 ms with minimal jitter, supporting real-time visualization and interactive feedback. Designed to separate deterministic control from high-level logic and user interaction, this architecture offers robust performance, scalability, and extensibility. It lays the groundwork for future integration of AI-based optimization, autonomous control, and predictive diagnostics in cyclotron operations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP003.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP004",
      "title": "Analog signal multiplexing system for the IOTA Proton Injector45The Fermilab Accelerator Science and Technology (FAST) Facility at FNAL is a dedicated research and development center focused on advancing particle accelerator technologies for future applications worldwide. Currently, a key objective of FAST Operations is to commission the 2.5 MeV IOTA Proton Injector (IPI) and enable proton injection into the IOTA storage ring. The low and medium-energy sections of the IPI include four frame-style dipole trims and two multi-function correctors with independently controlled coils, requiring readout of 32 analog channels for current and voltage monitoring in total. To reduce cost and optimize rack space within the PLC-based control system, a 32-to-4 analog signal multiplexing system was designed and implemented. This system enables real-time readback of excitation parameters from all magnetic correctors. This paper presents the design, construction, implementation, and performance of the multiplexing system.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP004.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP005",
      "title": "A new Python middle layer framework: Particle Accelerator MIddle LAyer (PAMILA)48MATLAB Middle Layer (MML) for accelerator control has been used by many facilities worldwide over the years. With the rise of Python's popularity, particularly for leveraging its advanced artificial intelligence and machine learning libraries, an international collaboration is underway to develop a similar software framework in Python. As part of this effort, we propose a new Python middle layer package, which is built on top of the *pint* unit-conversion package, and capable of handling any type of device-dependent unit conversion (including multiple-input multiple-output) for magnets and other equipment. This package is also compatible with a suite of modern experimental orchestration and data management tools widely used by beamlines at many light sources (i.e., *bluesky*, *ophyd*, and *tiled*), and provides a more modular approach for implementing high-level applications, facilitating re-use, while exposing comprehensive, yet manageable, options to end users.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP005.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP006",
      "title": "A self-supervised transformer for RF cavity signal denoising52A frequent occurrence within industrial particle accelerator systems is electromagnetic noise accumulating within RF Cavity Sensor readings, attributed to their electromagnetically dirtier operating environments and production, with less of an emphasis on their performance optimization. This phenomenon prevents signals from accurately relaying information to beam operators and specialists. Additionally, noisy signals inhibit the ability for feedback loops to meet their regulation requirements, making machine control much more difficult. Previous work has shown machine learning-based techniques as promising solutions for denoising that maintains signal quality and features. In this paper, we design, implement, and benchmark a self-supervised transformer-based machine learning algorithm that denoises In-Phase and Quadrature (I/Q) RF Cavity Signals without a need for referencing a clean ground-truth.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP006.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP007",
      "title": "Anomaly detection of slow-moving variables at LANSCE for improved beam quality55Modern accelerator facilities operate with a large number of variables, many of which can influence beam quality. While most of these variables are constrained within predefined boundary conditions, slow fluctuations over extended periods—from tens of minutes to a full day—can still significantly degrade beam performance. Due to their gradual nature and the difficulty in distinguishing meaningful trends from background noise, such variables often go unnoticed and remain unoptimized by operators for days. This study investigates the use of machine learning algorithms to identify and analyze these slow-moving variables. By applying advanced time-series analysis and feature importance ranking, the proposed approach reveals hidden correlations between slow variable drifts and a key beam quality metric: the ring loss at the Los Alamos Neutron Science Center (LANSCE). The results demonstrate the potential of machine learning to detect subtle anomalies and offer actionable insights to mitigate persistent beam quality issues that can disrupt operations for weeks at a time.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP007.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP008",
      "title": "Application of Bayesian optimization to BtA injection at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP008.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "BNL58",
      "title": "Drifting optimal settings and changing working conditions force accelerator operators to keep re-tuning control systems. At BNL, the RHIC injector complex accelerates many different ion species by varying a multitude of control knobs. In this report, we investigate the use of Bayesian optimization (BO) of the Booster-to-AGS (BtA) transfer line to maximize the beam brightness in the AG",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-BNL58",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOP009",
      "title": "A reactive ferroelectric tuner for microphonics compensation61Jefferson Lab (JLab) is actively pursuing an extensive research program focused on developing advanced Nb₃Sn superconducting technology for particle accel-eration. Due to the brittle nature of Nb₃Sn coatings, a Ferroelectric Tuner (FRT) currently represents the most viable approach for microphonics compensation in these next-generation cavities. We suggest a novel, fast-responding FRT integrated directly into the main coupler, eliminating the need for an additional RF port. Leveraging a unique RF design based on a magic-T configuration, this advanced FRT will enable micro-phonics compensation in the ±30 Hz range without undesirable changes to the external quality factor.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP009.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP010",
      "title": "AtomicAndPhysicalConstants.jl – A fast Julia package to access particle properties and fundamental constants65To support constants lookup for the SciBmad project, we introduced AtomicAndPhysicalConstants.jl, a Julia package that provides physical constants, subatomic particle properties, and atomic isotope data. It aggregates datasets from NIST (CODATA) and the Particle Data Group, offering a unified interface. The package supports configurable unit systems and data types, and integrates with the Julia package Unitful.jl. The package emphasizes speed and ease of use, making it well-suited for high-performance simulations and physics-driven modeling.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP010.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP011",
      "title": "Automated RF phase adjustment for beam stabilization in the Fermilab Linac68The Fermilab Linac delivers 400 MeV H- beam. Variations in environmental factors and Ion Source output result in day-to-day longitudinal phase drift leading to increased beam loss. Traditionally, phase drift is corrected by manual RF cavity phase adjustments, a process that is labor-intensive and suboptimal. This work explores machine learning-based automation of drift correction using data-driven modeling of the Linac behavior. After extensive experimentation with single-layer, multi-layer, and convolutional neural networks (CNN+NN), we now adopt a prototype-based classification approach to identify optimal correction strategies. The model leverages a reduced 34-dimensional feature set comprising 7 RF cavity settings and 27 Beam Position Monitor (BPM) phase readings. To model the beam longitudinal response, we construct a 7×27 response matrix by varying the 7 cavity phases. Due to the limited set real-world data, synthetic data generation from the response matrix is also being explored to enhance model training. This enables the simulation of diverse drift scenarios and improves the generalizability of learned corrections. Finally, in addition to the prototypical loss framework, we incorporate a surrogate energy-consistent loss that penalizes inconsistencies between predicted phase corrections and changes in beam energy—estimated from the 27 BPM readings—alongside a temporal smoothness constraint that discourages abrupt prediction shifts across sequential readings.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP011.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP012",
      "title": "Automation of sample alignment for neutron beamlines72Neutron scattering experiments are crucial for the exploration of molecular structure in compounds. The HB-2A neutron powder diffractometer at the High Flux Isotope Reactor at Oak Ridge National Laboratory conducts magnetic studies of samples by illuminating them with different energy neutron beams and recording the scattered neutrons. Proper and consistent alignment of the sample is necessary to ensure that high quality data is collected throughout an experiment. This process is currently performed manually by beamline scientists. RadiaSoft, in collaboration with the beamline scientists and engineers at ORNL, has developed a reinforcement learning-based agent capable of aligning and isolating samples. We use a Q learning structure to train the agent. The agent identifies the method to move the sample to the center of the beam and the proper amount to close the neutron camera slits. We then move the sample and close the slits using a custom Python-based EPICS IOC interfaced with the sample and slit motors. In this paper, we provide an overview of our reinforcement learning tools and show our results aligning samples like those at ORNL.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP012.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP013",
      "title": "Automation of sample identification for neutron beamlines74Neutron scattering experiments are a critical tool for the investigation of molecular structure in compounds. The HB-2A neutron powder diffractometer at the High Flux Isotope Reactor at ORNL conducts magnetic studies of samples by illuminating them with different energy neutron beams and recording the scattered neutrons. Proper identification and alignment of samples during an experiment is key to ensuring high quality data is collected. At present, this process is performed manually by beamline scientists. RadiaSoft, in collaboration with the beamline scientists and engineers at ORNL, has developed a machine learning-based software automating sample identification. We utilize a fully connected convolutional neural network configured in a U-Net architecture to identify the sample and its center of mass. We then move the sample using a custom Python-based EPICS IOC interfaced with the motors. In this poster, we provide an overview of our machine learning tools and show our results identifying samples at ORNL.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP013.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP015",
      "title": "Beam scattering through foil77This paper describes the foil structure used at the beam extraction point in the NASA Space Radiation Laboratory (NSRL) beamline. The stripping foil removes electrons from incoming ions, rendering them partially or fully stripped. Foils of various materials and thicknesses are employed, enabling ion species at different energies to pass through. As charged particles traverse a foil, the outgoing particles exhibit a Gaussian-like angular distribution. This distribution is subsequently transformed into a uniform profile by a set of octupole magnets, essential for various beam experiments at the NSRL target. We utilize the Bmad and SRIM computer codes to calculate the energy loss through the foils for different ion species, energies, and charge states. After preparing ion beam species in the Booster, we determine the energy loss by measuring the horizontal beam profile at the multi-wire MW063 location in the NSRL beamline. Finally, we present a summary of energy loss calculations obtained through Bmad, SRIM, and experimental data.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP015.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP016",
      "title": "Benchmarking the use of BPM quadrupole moments to measure emittance81For the PIP-II program, transverse emittance in the Fermilab Booster must remain well controlled at higher bunch intensities. 4-plate beam position monitors (BPMs) have a small but measurable quadrupole moment, making it possible to infer transverse emittance. By compositing many BPMs together, it becomes possible to improve the quality of the quadrupole signal. The Fermilab Booster BPM system has been used to measure these quadrupole moments in the past year and derive emittances from them. Recent benchmarks show that the derived BPM emittances show similar emittance evolution and value to IPM and Multiwire data. This approach can both supplement and complement existing non-intercepting emittance monitors in accelerators.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP016.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP018",
      "title": "Modernizing wire scan diagnostics for reproducible, real-time beam measurements through a modular Python middle layer integrated with EPICS85As part of a broader effort to modernize beam diagnostics at SLAC, we are developing a new middle-layer application to support wire scan measurements using Python. This tool is designed to replace aging MATLAB GUIs with a streamlined framework that interfaces directly with EPICS and Beam Synchronous Acquisition systems. The middle layer manages the complete wire scan workflow while emphasizing modularity, reproducibility, and integration with existing controls infrastructure. This talk will cover the system architecture, practical implementation details, and lessons learned in deploying a diagnostic tool suited to the high-throughput, real-time needs of accelerator operations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP018.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP019",
      "title": "Bunch duration measurements in the APS-U booster88We present the results of time-based, bunch length measurements in the Advanced Photon Source Upgrade booster synchrotron using the bunch duration monitor (BDM) optical diagnostic. The BDM diagnostic is based on the detection of visible-wavelength synchrotron radiation. The detector is a metal-semiconductor-metal device followed by 42 dB of wide-band amplifier gain. Bunch duration is determined by de-convolving the raw output signal with the circuit’s impulse response function. The BDM allows measurement of bunch duration over virtually the entire booster ramp. De-focusing in the optical path was necessary to overcome thermal steering from the in-tunnel mirror. Also, the effects of detector saturation must be considered to ensure a linear response. Presently, the booster increases bunch energy from 425 MeV to 6 Ge",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP019.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP020",
      "title": "Towards real-time calibration of CBPMs using synchronous RF injection92Cavity beam position monitors (CBPMs) are very high-precision devices that, in recent years, have progressed from experimental equipment to standard linac diagnostics in many prominent facilities, most notably free electron lasers. However, the high sensitivity of these devices comes at the cost of a limited measurement range, even with high dynamic range electronics. Furthermore, CBPMs need to be calibrated in situ, ideally by introducing a known beam offset, which is often impractical in large installations. This paper reports on a method to match CBPM beam signals by injecting synchronized and tightly controlled bursts of radio frequency (RF) oscillations into the sensor cavity and reading back their superposition. The method allows compensation for static beam offsets (with beam) and calibrates CBPMs electronically (no beam required), thus removing some of the operational hurdles. We discuss the first demonstration of this method at the Accelerator Test Facility 2 (ATF2)",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP020.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP021",
      "title": "Compact 3D electro-optic sampling beam position monitor96RadiaBeam and University of Colorado Boulder have developed a 3D beam position monitor based on the well-established electro-optic sampling (EOS) technique, enabling non-interceptive, ultrafast position monitoring of high-intensity femtosecond beams. Based on the initial prototype of the 2D EOS-BPM, using 1 pair of crystals, installed at SLAC FACET-II, this 3D design has undergone several iterations. A fully functional prototype was manufactured and bench tested using Off-Axis Parabolic (OAP) mirrors to focus the laser on 2 sets of 2 crystals. However, due to the difficulty of working with OAPs and the offset of the crystal pairs, a new EOS-BPM was developed using an axicon lens to shape the laser into an annulus at the crystal plane. This dramatically simplifies the setup, reduces its footprint, and provides full 3D information from a single laser beam. Once installed, the EOS-BPM can yield the full 3D centroid positioning of two bunches in a wakefield accelerator, or the tilt of a beam used to power a light source. Under ideal conditions, simulation-based estimates show temporal and transverse resolution for the beam centroids of a two-bunch wakefield accelerator beam of order 50 fs and 1 μm, respectively.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP021.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP025",
      "title": "Design, characterization, and validation of a pulsed RF burst source for in-situ cavity beam position monitor calibration98Beam Position Monitors are critical instruments in accelerator facilities, providing precise beam orbit measurements with tens of nanometers resolutions, essential for the operation of current linac-based FELs and future linear colliders. In this report, we introduce the development and successful testing of a pulsed RF burst source specifically designed for BPM calibration. The source was characterized and installed at the ATF2 facility in KEK, Japan. The system injects tailored RF pulses into the BPM cavity via one of the two output ports. With the capability to adjust frequency and pulse width, to emulate beam pulses, the system demonstrated nearly complete cancellation of beam-generated signals when the injected RF pulse overlapped with the beam pulse. This source has the potential for in-situ BPM calibration, mitigation of static signal contributions caused by cavity misalignments and capacity for wakefield compensation. Dedicated hardware development for further refinement of the source is underway at Royal Holloway, University of London, using two TI",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP025.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP026",
      "title": "Design of phase diversity Electro-Optic Sampling of THz coherent transition radiation102We report progress on the design of a Phase Diversity Electro-Optic Sampling (DEOS)-based longitudinal profile measurement system. The current design uses THz coherent transition radiation (CTR) to convey the bunch’s longitudinal information. A 1550nm fiber laser available at the Argonne Wakefield Accelerator facility will be used as the probe for electro-optic sampling. Specifically, we discuss pulse synchronization and probe beam transport, the design and optimization of the probe beam stretcher, and the design of the probe beam detection system.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP026.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP028",
      "title": "Facility-scale differentiable virtual accelerator at Fermilab106As the design complexity of modern accelerators grows, there is more interest in using advanced simulations and algorithms that have fast execution time or yield additional insights. One notable example are the gradients of physical observables with respect to design parameters, which are broadly useful in optimization and uncertainty analysis. The IOTA/FAST facility has been working on implementing and experimentally validating an end-to-end virtual accelerator test stand that is both fast and gradient-aware, allowing for rapid prototyping of new software and experiments with minimal beam time costs. We describe the selection and benchmarking of both physics and ML codes for linac and ring simulation, including obtaining parameter gradients with autodiff. We will also show the development of generic interfaces between surrogate and physics-based sections, and how the control interface is exposed as either a deterministic discrete event simulator or a fully asynchronous EPICS/ACNET soft IO",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP028.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP029",
      "title": "Development and applications of differentiable coherent optical transition radiation simulations110Optical transition radiation (OTR) beam profile monitors are widely used to measure the transverse profiles of low-charge electron bunches at advanced linear accelerator facilities such as LCLS-II and FACET-I",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP029.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP030",
      "title": "Development of an upgraded fast orbit feedback system for NSLS-",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP030.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "IIU113",
      "title": "As light source facilities evolve, upgrading fast orbit feedback systems is essential for improving beam stability. NSLS-II is planning an upgrade to NSLS-IIU, which introduces stricter stability requirements for advanced experiments. To address this, we developed a next-generation fast orbit feedback prototype system to enhance noise suppression and extend control bandwidth beyond 1 kHz. A system-wide evaluation was conducted, covering beam position monitors, cell controllers, power supply controllers, power supplies, and vacuum chamber effects. Latency and bandwidth bottlenecks were identified in the cell and power supply controllers. A new cell controller was designed to increase the sampling rate from 10 kHz to 31.5 kHz and reduce system latency to under 70 µs. The transfer function and gain measurements of a single-input-single-output system show a 10-dB improvement in noise suppression and an extension of bandwidth into the kHz range. We present the development and performance results of the upgraded system, offering a path toward higher beam stability at NSLS-IIU.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-IIU113",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOP032",
      "title": "Digital camera performance in a high-radiation accelerator test beam facility117Digital cameras are critical diagnostics at test beam facilities. At FACET-II, there are over 100 digital cameras in operation. The 10 GeV electron beams cause high levels of radiation, which makes profile monitors susceptible to two types of failures: single-event upsets (SEU) and permanent death. The Camera Watchdog software was deployed to monitor and automatically power cycle cameras in the case of an SE",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP032.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP034",
      "title": "Efficient 6-dimensional phase space measurements and applications to autonomous monitoring at LCLS-II120Increasing the performance and capabilities of free electron lasers, such as LCLS-II, hinges on our ability to precisely control and measure the 6-dimensional phase space distribution of the beam. However, conventional tomographic techniques necessitate a substantial number of measurements and computational resources to characterize a single beam distribution, using many hours of valuable beam time. Novel diagnostic techniques are needed to significantly reduce the number of measurements required to reconstruct detailed, 6-dimensional beam features to enable feedback for precision beam shaping for accelerators and characterize unknown physical phenomena. In this work, we present a novel approach to analyzing experimental measurements using differentiable beam dynamics simulations and generative representations of 6-dimensional phase space distributions. We discuss developments in combining this work with advanced accelerator control algorithms and parasitic beam measurements to autonomously monitor the 6-dimensional phase space distribution of the beam at LCLS-II during accelerator operations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP034.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP035",
      "title": "Experimental longitudinal emittance manipulation using laser-based photoionization in the Fermilab Linac124A series of simulations and beam studies were conducted at Fermilab’s linear accelerator to evaluate the effectiveness of longitudinal emittance control via laser-induced photoionization. While similar laser techniques have been employed at Fermilab to enhance injection and extraction efficiency into the Booster, the work presented here focuses on extending these methods to bunch-by-bunch manipulation. This approach utilizes fine-scale correction of the H- bunches’ longitudinal spatial distribution. In theory, loosely confined particles in longitudinal phase space contribute to emittance growth during acceleration. By selectively removing these outlying particles through laser scraping (H- + γ → H + e-), this growth can be reduced. This report presents experimental results from both symmetric and asymmetric longitudinal scraping of H⁻ bunches in the Fermilab linac, which were subsequently injected into Booster, and evaluates the broader applicability of this method for future high-intensity accelerator operations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP035.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP037",
      "title": "Calculating beam extinction in a pulsed proton beam using FPGA-based peak detection127The Mu2e experiment at Fermilab imposes stringent requirements on the elimination of out-of-time beam in its pulsed proton beam, a requirement known as “extinction”. Utilizing a new μTCA-based FPGA data acquisition system, we recorded live particle data from scattered particles incident on an array of quartz Cherenkov radiators and photomultiplier tubes to measure the extinction in the inter-pulse gaps in the pulsed proton beam. Minuscule errors in the derived signal period can make a measurement of the extinction impossible, so after taking a Fourier transform, further optimizations on the period were done based on the assumption that the signal period is stable over the full time of the beam spill while it is being resonantly extracted. After these optimizations, the beam extinction was shown to be on the level of $10^3$.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP037.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP039",
      "title": "Fast adaptive neural control of resonant extraction at Fermilab131We present the development of a machine learning (ML) regulation system for third-order resonant beam extraction in the Mu2e experiment at Fermilab. Classical and ML-based controllers have been optimized using semi-analytic simulations and evaluated in terms of regulation performance and training efficiency. We compare several controller architectures and discuss the integration of neural control into an adaptive framework. In addition, we report progress on implementing low-latency, edge-based inference to enable deployment in hardware-constrained environments. This work demonstrates the feasibility and potential advantages of ML-based control for regulating complex, non-stationary systems, with applications extending beyond resonant extraction.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP039.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP040",
      "title": "Fast beam probe development for longitudinal bunch measurements at UC Davis Crocker Nuclear Laboratory Cyclotron135The UC Davis Crocker Nuclear Laboratory (CNL) operates a 76-inch Isochronous Cyclotron dating to the 1960s. Recent experiments have revealed unexplained beam behavior, which cannot be directly measured with the current diagnostics. Direct measurements of the beam in the Cyclotron are challenging due to the harsh environment, including high radiation, strong magnetic fields, RF interference, and spatial constraints. To address this, we are developing a novel beam probe capable of resolving longitudinal bunch structure across 16 positions simultaneously. The fast beam probe consists of a segmented fast plastic scintillator array coupled via fiber optics to external Silicon Photomultipliers (SiPMs), mounted on a radially translating probe. We report on the probe's performance from in-air tests at the general-purpose beamline. The results demonstrate sub-nanosecond resolution, consistent sensitivity across channels, and clear signatures of beam dynamics, establishing the system’s viability for measurements inside the CNL Cyclotron.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP040.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP042",
      "title": "FPGA-based spill regulation system for the Muon Delivery Ring at Fermilab138The Muon to Electron Experiment (Mu2e) requires a uniform beam profile from the Muon Delivery Ring to meet their experimental needs. A specialized Spill Regulation System (SRS) has been developed to help achieve consistent spill uniformity. The system is based on a custom-designed carrier board featuring an Arria 10 SoC, capable of executing real-time feedback control. The FPGA processes beam pulses of approximately 200 ns every 1.695 microsecond, allowing for continuous monitoring of the extracted spill intensity through fast bunch integration. The system directly controls three quadrupole magnets, which work in conjunction with sextupole magnets to achieve third-order resonant extraction. Furthermore, the board interfaces with Fermilab’s Accelerator Control Network (ACNET), enabling operators to modify spill regulation settings in real-time via the control network while providing diagnostic waveforms. These waveforms help operators monitor the process and fine-tune the feedback mechanisms. This paper presents an overview of the board's architecture and its initial progress toward regulating beam extraction. This initial version of the regulation system aims to evaluate baseline performance to inform future system improvements.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP042.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP043",
      "title": "FPGA implementation of a digital signal component separator and a disturbance compensator for the LANSCE 805 MHz solid-state high power RF amplifier142Because of aging, and product discontinuity, LANSCE is investigating the replacement of high power RF amplifiers. A promising candidate is the GaN solid-state power amplifier (SSPA). For a high drain voltage, the drain power dissipation of SSPA is increased as the operating efficiency becomes low. The outphasing technique provides high efficiency operation of the SSP",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP043.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP044",
      "title": "GTPSA.jl: A SciBmad interface to the generalised truncated power series algebra library145A full-featured interface package to the Generalised Truncated Power Series Algebra (GTPSA) library in MAD-NG has been implemented in the Julia programming language. GTPSA performs fast Taylor-mode automatic differentiation (AD) of functions to arbitrary orders in the specified variables and parameters. In particular, GTPSA excels at computing derivatives to high orders (>1) and high numbers of variables/parameters, making it an extremely powerful tool for use in optimization and in computing parametric Taylor maps. This Julia interface offers another simple way of using the GTPSA library, and will be used extensively in the SciBmad accelerator physics software ecosystem. The interface can also be easily called from Python, via the juliacall package. In this paper, we showcase features implemented in the interface package including performance enhancements, and present an example of integrating a GTPSA map using polymorphic integrators already implemented in Julia.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP044.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP045",
      "title": "HED-Melt: A coupled framework for modeling high-energy-density conditions in accelerators149The high-brightness beams used by modern light sources and accelerators present a new challenge for machince protection. These beams, through impacts with beam intercepting components such as collimators, may generate high-energy-density (HED) conditions capable of causing significant damage to machine components. One significant issue in studying these dynamics is that lack of simulation tools which capture all of the physics present. Particle tracking and particle-matter interaction codes are widely used in accelerator design but the is not significant interfacing between the two and few codes are available to simulate the melting and vaporization seen in some beam strikes. HED-Melt (High Energy Density Modeling of ELectron beam impacts Toolkit) is a framework of coupling three physics codes, elegant, fluka, and flash to model the effects of HED conditions in various accelerators components. The toolkit automatically interfaces between the three codes to run a full-physics simulation of HED conditions for a user-defined machine lattice.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP045.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP048",
      "title": "Implementation of a 1550-nm laser system for beam characterization at the Argonne Wakefield Accelerator153Accurately recording an electron bunch’s longitudinal profile is an important diagnostic for wakefield accelerators employing shaped bunches to increase transformer ratios. Electro-optic sampling of terahertz radiation from the bunch is an attractive approach due to its non-destructive nature. In preparation for future characterization experiments, the Argonne Wakefield Accelerator test facility has recently installed a 1550 nm laser system, including the necessary support systems to synchronize with the photoinjector laser system at 81.25 MHz. We report here on the initial installation and synchronization demonstrations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP048.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP050",
      "title": "Improve beam brightness with bayesian optimization at the AGS booster injection at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP050.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "BNL157",
      "title": "Alternating Gradient Synchrotron (AGS) and its Booster serve as part of the injector compound for RHIC and the future EIC at Brookhaven National Laboratory. Injection and early acceleration processes set maximum beam brightness for the collider rings. Such processes have many control parameters and are traditionally optimized empirically by operators. In an effort to streamline the injection processes with machine learning (ML) techniques, we develop and test a Bayesian Optimization (BO) algorithm to automatically tune the Linac to Booster (LtB) transfer line magnets to maximize beam brightness after injection into the Booster. We present experimental results that demonstrate BO can be applied to optimize Booster injection efficiency.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-BNL157",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOP051",
      "title": "Instrumentation for a prototype fusion propulsion system160A prototype colliding beam accelerator has been fabricated for the study of a fusion-based propulsion concept for interplanetary exploration. The purpose of this prototype is to demonstrate collider luminosities commensurate with the requirements of this application. While fusion fuels such as p/Li7 and He3/He3 would generate the required thrust characteristics, this prototype currently employs deuterium. Because neutrons are produced via DD fusion with a peak cross section of 0.1 barns, even modest initial luminosities yield event rates suitable for real-time measurements and lifetime monitoring. The proposed luminosity monitor is based on neutron moderation and absorption and subsequent gamma-ray detection. Sodium chloride serves as the moderator, with most neutrons absorbed by chlorine-35 nuclei having a thermal neutron absorption cross section of 43.6 barns. The collider is a linear device employing electrostatic axial confinement and radial focusing. A combination of destructive and nondestructive sensors are employed to monitor various beam parameters such as intensity, energy spectrum, transverse tunes and halo density distribution.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP051.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP052",
      "title": "Design of a BPM pick-up for the EIC electron storage ring163A new beam position monitor (BPM) pick-up, compatible to operate reliably with the high current electron beams foreseen in the 5 - 18 GeV Electron Storage Ring (ESR) of the Electron-Ion Collider (EIC) project, is presented. We discuss a few design options for this button-style BPM pick-up with a focus on output signal levels, position characteristic, and wakefield effects. Regarding the octagonal cross-section geometry of the ESR vacuum chamber, the BPM pick-up analysis relies on numerical methods, here performed using the CST Studio software.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP052.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP053",
      "title": "Investigation of IPM profile changes with variations in the applied electric field167Variations in the applied electric field in the Ionization Profile Monitor (IPM) affects the time of flight for the ionized particles (primarily electrons) which could affect the measured transverse beam profile. In addition, the applied electric field may affect the space charge of the ionized electrons inside the IP",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP053.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP054",
      "title": "Lifetime extension of legacy CEBAF LLRF hardware171A significant portion of the Low-Level Radio Frequency (LLRF) hardware in Jefferson Lab’s CEBAF is from the original construction of the facility using 1980’s CAMAC technology. Of the fifty-three zones in CEBAF, thirty-six of them are legacy hardware. The age of the legacy system has led to difficulties in maintaining the hardware due to parts going obsolete without suitable drop in replacements. Continued operation of the legacy system is required as the installation of LLRF 3.0 systems is costly and cannot be completed in a short period of time with the available resources. The most pressing failure in the legacy system was a failing buffer card, which is responsible for communication between the EPICs network and individual RF control modules. A new buffer card was designed as a transparent, drop in, replacement so that upgrades are simply a matter of swapping the existing legacy hardware. This buffer card upgrades a single point failure component and promises to extend the operable lifetime of CEBAF’s legacy systems.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP054.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP055",
      "title": "Low-charge, high-resolution beamline preparation for the nanopatterned microbunching experiment at Argonne Wakefield Accelerator173The emittance exchange (EEX) beamline at the Argonne Wakefield Accelerator (AWA) is designed to transfer properties of an electron beam phase space between the transverse and longitudinal planes. Recently, it has been proposed this beamline could be used to convert a microscale transverse modulation created by a TEM grid into a microbunch train in the longitudinal plane.* Such a technique would be useful for obtaining nano-scale microbunching that does not rely on the sensitive process of FEL gain. This new approach has been proposed to enable development of a compact free-electron laser at Arizona State, greatly reducing size and cost compared with existing short wavelength FELs. To perform an exploratory demonstration of this concept at AWA, this experiment requires low normalized emittance (~50 nm*rad), low charge (~1pC) electron bunches, and transverse diagnostics with high-resolution (1-3 microns) and high-light-collection to resolve the modulation on the electron beam. This report will give a progress update on preparing the necessary beams and diagnostics at AWA for an emittance exchange experiment that would produce 100s of nm scale microbunches.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP055.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP056",
      "title": "Machine learning assisted Bayesian calibration of accelerator digital twin from orbit response data177Digital twins of particle accelerators are used to plan and control operations and design data collection campaigns. However, a digital twin relies on parameters that are hard to measure directly, e.g., magnet alignments, power supply transfer functions, magnet nonlinearities, and stray fields. These parameters can be constrained by beam position and profile measurements. We use Bayesian statistical inference to estimate the parameters, and their uncertainties, probabilistically by calibrating the Bmad digital twin to beam measurements. The inference is computationally accelerated using a machine learning emulator of the physical accelerator digital twin trained to a perturbed-parameter ensemble of Bmad simulations. The result is a joint posterior distribution over parameters (control currents, individual magnet transfer function coefficients, and beam monitor errors) which is propagated to uncertainties in predicted beam positions and profiles, which we validate against beam responses measured at the AGS booster at Brookhaven National Laboratory.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP056.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP057",
      "title": "Machine learning at the Spallation Neutron Source accelerator and target181We describe the ongoing efforts to apply Machine Learning techniques to improve the performance of our accelerator and target. Specially, we are looking to minimize halo beam losses in the absence of a proper physics model, automatically detect and log anomalies in the target support systems such as cooling, and detect and prevent errant beam pulses in the linac. We also describe the infrastructure we use to acquire and stream data to the GPU cluster for training, our code development cycle, and edge computing for model inference. To minimize halo beam losses, we use a Reinforcement Learning technique tested on a virtual accelerator. The target anomaly detection is trained on archived data using incomplete physics models and is made part of the existing target reporting system. The errant beam prevention analyzes beam current and beam phase waveforms as well as accelerator configuration data to predict errant pulses. We also develop continual learning to adapt to changes in the accelerator.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP057.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP059",
      "title": "Machine learning-enhanced infrared imaging for temperature anomaly detection in power supplies185The performance of particle accelerators is critically dependent on the reliability of their power supplies, which can number in the thousands in many facilities. In this work, we present a method for monitoring temperature anomalies in power supplies using infrared (IR) imaging. By applying various machine learning algorithms to the IR imaging data, we develop a reliable anomaly detection system that can improve the uptime of accelerator facilities. This approach enables early detection of potential issues, facilitating predictive maintenance and enhancing overall operational efficiency.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP059.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP061",
      "title": "Mitigating IDVC thermal deformation with mechanical constraint for reliable ID minimum gap operation189Premature activation of the insertion device (ID) minimum-gap limit switches was observed during beamline commissioning at the Advanced Photon Source Upgrade (APSU). This issue was traced to vertical deformation of the insertion device vacuum chamber (IDVC) due to temperature differences with its strongback. Direct measurements of temperature and vertical displacement of IDVC in a selected sector of the APS storage ring confirmed this effect, and simulations successfully reproduced the thermal deformation mechanism. To address the issue, we developed a simple mechanical constraint to limit the vertical displacement, rather than actively compensating for the temperature difference through enhanced heat transfer. This paper reports the investigations, proposed mechanical solution, simulation, and measurement validation after its installation. Post-installation tests successfully demonstrated its effectiveness, allowing the IDs to reach the minimum gap without triggering the limit switch.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP061.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP064",
      "title": "Online accelerator modeling with two controls systems at FACET-II193FACET-II is a unique experimental facility housed in 1 km of the original Stanford Linear Accelerator tunnel. Multiple generations of hardware are still in use, as are two generations of software controls. A majority of subsystems (RF, magnets, timing, etc.) have their controls split across both ecosystems. Three software layers, including a newly-developed online modeling infrastructure, bridge this gap to form a unified high-level abstraction of the accelerator used for data analysis and as a foundation to develop control-room physics applications. We discuss the implementation of this infrastructure and some downstream programs.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP064.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP065",
      "title": "Integrating simulation and machine learning for Proton Storage Ring beam analysis196The Proton Storage Ring (PSR) at the Los Alamos Neutron Science Center (LANSCE) accumulates a 625-μs-long beam and compresses it into a 290-ns-long (base-to-base) short pulse for delivery to the Lujan Center. Due to its high-intensity operation, the PSR also functions as a highly-sensitive mass spectrometer for the entire accelerator complex. Changes in PSR beam losses are more responsive to linac drifts than any other diagnostic system, making continuous monitoring and characterization of the PSR critical to overall performance. Currently, PSR operation is primarily guided by beam loss signals, while key physics parameters—such as the betatron tune, closed orbit, and injection offsets—are typically measured only once per day. Furthermore, Beam Position Monitors (BPMs) can only provide meaningful data a single 290-ns-long injection, requiring dedicated machine time and resulting in operational downtime. However, recent upgrades to both the data acquisition and chopper systems now enable continuous measurements during standard operation. In this work, we employ a Convolutional Neural Network (CNN) trained on simulated data to infer critical beam parameters in real-time. This approach will be tested and implemented during the 2025 run cycle to enable online monitoring and improved control of PSR beam dynamics.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP065.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP066",
      "title": "Online multi-objective Bayesian optimization of injection efficiency and beam lifetime with skew quadrupoles at NSLS-II199At NSLS-II, the vertical emittance of electron beam is typically blown up to ~30 pm with a coupling wave to increase beam lifetime during user operation. As more and more insertion devices are added to the storage ring, injection efficiency to the ring drops noticeably in certain machine states, apparently due to degraded dynamic apertures. To help alleviate this issue, we have recently performed online multi-objective Bayesian optimization to increase injection efficiency while maintaining beam lifetime, by adjusting the strengths of 15 skew quadrupoles in non-dispersive sections. We report the results of this optimization effort.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP066.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP068",
      "title": "Oscillation Data Analysis during the LCLS-II Commissioning at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP068.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SLAC203",
      "title": "Analyzing the betatron oscillation of a beam is mainly used to find focusing errors in the lattice, like quadrupole errors. The generated trajectory differences can be compared with the design lattice or the current machine lattice where some magnets have been changed for different purposes or accidentally. Each method has different advantages and disadvantages like finding a quadrupole which got turned off by mistake won't be discovered with the current lattice method, while matching quadrupoles errors (which get tuned away from design) are harder to identify with the design lattice comparison. Besides lattice errors BPM (Beam Position Monitor) problems can be found too. Interpreting the data can have many pitfalls, some will be explained.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-SLAC203",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOP069",
      "title": "New ACE3P capabilities and code integration of ACE3P with Geant4 and Lume206The Advanced Computational Electromagnetic 3D Parallel simulation suite (ACE3P), developed by SLAC National Accelerator Laboratory, is a state-of-the-art multi-physics toolkit designed for virtual prototyping of accelerator and RF components. Leveraging over two decades of development, ACE3P integrates advanced physics modeling, including thermal and structural modeling, capabilities with scalable numerical algorithms to deliver cutting-edge simulations. The suite, comprised of seven application modules, utilizes high-order curved finite element methods to achieve high accuracy while enabling fast simulations for large-scale problems. Two recent advancements include the integration with Geant4, for radiation studies and positron source generation, and the development of LUME-ACE3P, built on the Python framework of the LUME project*, which streamlines parameter sweeps and optimization tasks. Furthermore, recent code optimizations have increased the performance of ACE3P for large-scale computations on modern supercomputers. We present a real accelerator project study with ACE3P to demonstrate its scalability and efficiency conducted on NERSC supercomputers.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP069.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP070",
      "title": "Performance optimization of the IOTA duoplasmatron proton source210We present results from online optimization studies of a duoplasmatron ion source designed to produce 50 keV protons for acceleration to 2.5 MeV and subsequent injection into the Integrable Optics Test Accelerator (IOTA) at Fermilab. Using a Bayesian exploration technique, we developed multi-parameter models of the source’s proton current and employed these models to optimize its performance. Depending on the spectrometer configuration used to isolate the proton beam and the chosen optimization objective, we identified three candidate operating points, achieving normalized 50 % emittances between 0.57 μm and 1.3 μm and a maximum proton current of 14.5 ± 0.6 mA.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP070.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP072",
      "title": "Transverse phase space tomography at FACET-II214We present recent development of transverse phase space tomographic reconstruction techniques at FACET-I",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP072.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP073",
      "title": "Physics considerations for a harp system design at the Second Target Station of the Spallation Neutron Source217A harp system is being developed for monitoring proton beam profile direct upstream of the proton beam window at the Second Target Station of the Spallation Neutron Source, Oak Ridge National Laboratory. It consists of two sensor planes which have arrays of thin conducting wires aligned vertically and horizontally, respectively. It monitors beam profiles in two transverse directions to the beam axis by measuring the net-charge depositions in the sensor wires, which are caused by ejection of secondary electrons and delta rays driven by electromagnetic interactions with high-energy protons. The net charge deposition in a sensing wire linearly correlates with the number of incident protons on it. This correlation is perturbed when the wire interacts with secondary electrons and delta rays originating from beam-matter interactions in neighboring wires, PBW and residual gases. In this paper, we analyze the physical phenomena that affects the measurement uncertainties of the harp using particle transport simulations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP073.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP075",
      "title": "Detectors and beam monitors based on wide bandgap semiconductors at cryogenic temperatures221Wide-bandgap semiconductors, such as single-crystal diamond and sapphire, can be used to measure the flux of passing particles through a particle-induced conductivity effect. We recently demonstrated a diamond-based, electrodeless electron beam halo monitor. This monitor utilized a thin diamond blade placed within an open, high-quality microwave resonator. The blade partially intercepted the beam and changes in the RF properties of the resonator were used to infer beam parameters. To enhance the sensitivity of our semiconductor sensors, we propose two new techniques: (1) biasing the semiconductor sensor to support avalanche multiplication of free carriers, and (2) operating at cryogenic temperatures to reduce intrinsic semiconductor losses and increase the mobility of induced carriers. These techniques are applicable not only to particle beam diagnostics but also to the detection of various types of ionizing radiation.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP075.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP076",
      "title": "Preliminary study of auto-differentiation algorithm in beam dynamics with stochastic process225Modern particle accelerator optimization requires sophisticated computational methods to address the inherently stochastic nature of beam dynamics. This research develops a framework applying AD to SDEs that specifically addresses beam dynamics challenges in particle accelerators, focusing on accurately modeling and optimizing beam behavior in regimes dominated by stochastic processes. By incorporating key physical phenomena such as synchrotron radiation, wakefield effects, and quantum excitation, the framework aims to provide auto differentiation on the figure of merit of the phase space evolution and beam dynamics. The methodology will enable effective optimization method in a dynamic system with stochastic process.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP076.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP078",
      "title": "Proposal to measure bunch lengths using a pulse dilation photomultiplier tube229Electron bunches in storage rings are typically short (~100 ps) and separated by long periods of time (>2 ns). A pulse dilation photomultiplier tube offers a new way of measuring high bandwidth optical pulses using low bandwidth oscilloscopes. Experiments performed by others have demonstrated a temporal resolution of 12 ps, meeting requirements for electron bunches expected for the Advanced Photon Source Upgrade. Compared to electrooptical streak cameras, we think that this may be a preferred technique for measuring the longitudinal profile of bunches in electron storage rings.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP078.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP079",
      "title": "Proposal to streak optical pulses using a solid state optical deflector232Streak cameras are flexible cameras used to measure the temporal profile of optical pulses. Streak cameras have been employed to measure the longitudinal beam profile on accelerators around the world. In the present work, we highlight a potential alternative to a new streak camera. We consider particularly linear (Pockels) and quadratic (Kerr) electro-optical nonlinearity solid-state streaking systems. Of the possible solid state systems, we motivate the potential advantages of a Potassium Tantalum Niobate KTa1-xNbxO3 crystal as a photon beam deflector to measure the longitudinal profiles of electron beams in accelerators.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP079.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP083",
      "title": "Resonant cavity for quadrupole moment measurements of heavy ion beams236Non-invasive and fast beam emittance measurement is highly demanded for accelerated multi-charge-states heavy ion beams. The driver linac of the Facility for Rare Isotope Beams is the first accelerator intended to accelerate multiple charge states of stripped heavy ion beams and deliver up to 400 kW to the isotope production target. Emittance measurements of, for example, five charge states of uranium beam using conventional wire profile monitors take more than an hour in one location and add up to a few hours throughout the linac. This work presents design studies for a resonant cavity monitor capable of instantaneous measurement of the quadrupole moment of the beam distribution. Coupling with the beam and signal acquisition system, the separation between monopole, dipole, and quadrupole modes of the cavity are discussed.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP083.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP084",
      "title": "RF characterization of a cryogenic X-band cavity beam position monitor for superconducting undulator applications at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP084.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SLAC240",
      "title": "Superconducting undulators (SCUs) have gained significant interest due to their advantages over permanent magnet undulators, including the ability to achieve higher magnetic fields and shorter periods, leading to enhanced photon energy gain. As part of the SCU project at SLAC, an X-band cavity beam position monitor (BPM) has been designed and fabricated. This BPM plays a crucial role in the SCU assembly ensuring precise beam alignment with sub-micron resolution. The BPM incorporates two rectangular cavities for X- and Y-position measurements and a cylindrical reference cavity, all housed within a single copper block. Each cavity is separated by approximately 30 mm, which eliminates crosstalk between channels. The design of each cavity includes a single WR-75 waveguide port with a ceramic window as vacuum-air interface for out-coupling the EM field from the cavity to the external circuit. Additionally, each cavity is equipped with a tuner pin for resonant frequency adjustments. In this work, we report on the RF characterization of the BPM cavities conducted at both room and cryogenic temperatures. A consistent resonant frequency shift of approximately 37 MHz was observed when cooling the cavities from room temperature to 40 K, which is the nominal operating temperature within the undulator cryomodule. These measurements validate the predictions made during the BPM design phase through simulations. We also discuss future plans and possible applications beyond the SCU project.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-SLAC240",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOP086",
      "title": "SEM grid testing at NLCTA in BeamNetUS program244We report on the performance of a secondary electron monitor (SEM) grid for determining the transverse profile of an MeV range electron beam tested at SLAC National Accelerator Laboratory’s NLCTA facility. When inserted into the path of the electron beam, secondary electron emission results in a measurable current on the wires that make up the grid. We present measurements using this technique to reconstruct the beam profile. The SEM grid was designed and built by a team of Harvey Mudd College (HMC) undergraduate students and tested at SLAC’s NLCTA facility in collaboration with NCLTA staff as part of the BeamNetUS program. This SEM grid, developed for real-time measurements of an MeV scale electron beam, could have applications in industry and medicine.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP086.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP087",
      "title": "Status of longitudinal bunch-by-bunch feedback system at the upgraded Advanced Photon Source248The upgraded Advanced Photon Source (APS) is using twelve Radio Frequency (RF) cavities from the original APS RF system to compensate for beam energy loss. Undamped higher order modes (HOMs) from these cavities pose a risk of instability under the new APS conditions. Dimtel iGp12 processor-based bunch-by-bunch Longitudinal Feedback (LFB) system is developed to address longitudinal coupled-bunch instabilities caused by HOMs. These instabilities are exacerbated by the reduced synchrotron frequency and faster growth rates in presence of bunch lengthening system. The mitigation strategy involves initially reducing growth rates through precise cavity temperature tuning, followed by employing the LFB system to effectively manage residual growth rates. Resonance cavity temperatures of the HOMs have been characterized under APS conditions, providing a reference for tuning in the upgraded APS operation. The LFB system is designed to operate in both phase and energy sensing modes. This paper presents the feedback configuration, initial commissioning results with phase and energy sensing modes, and the feedback setup for operations.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP087.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP089",
      "title": "Surrogate model for third-integer resonance extraction at the Fermilab Delivery Ring251We present an ongoing work in which a surrogate model is being developed to reproduce the response dynamics of the third-integer resonant extraction process in the Delivery Ring (DR) at Fermilab. This is in pursuit of smoothly extracting circulating beam to the Mu2e Experiment’s production target, whereby the goal is to extract a uniform slice of the circulating 1e12 protons in the DR over 25,000 turns (43 ms). The DR contains 3 harmonic sextupoles that excite a third-integer resonance and three fast, tune-ramping quadrupole magnets that drive the horizontal tune towards the 29/3 resonance. In our initial work, the surrogate model trains on a semi-analytical simulation provided in the same format as live data. Using Reinforcement Learning (and other potential ML methods), the trained surrogate acts as the “environment” in which a simple ML control agent could learn to dynamically adjust the quadrupole ramp at 430 break points within the 43 microsecond spill window. The controller will be hosted on a dedicated Arria 10 FPG",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP089.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP090",
      "title": "Synchrotron frequency measurements using bunch by Bunch longitudinal feedback system in a storage-ring with higher harmonic cavity255The upgraded Advanced Photon Source (APS) features a 1408 MHz superconducting Bunch Lengthening System (BLS) to improve beam lifetime and emittance. The main RF system is significantly affected by ambient 60 Hz-harmonics noise, complicating the measurement of synchrotron frequency under varying higher harmonic cavity conditions. To address this, using Dimtel iGp12 processor-based longitudinal feedback system we developed two methods to measure synchrotron frequency effectively. Our approach involves driving multi-bunch beam modes by considering a span for synchrotron frequency sideband and analyzing mode amplitude changes across the sweep frequency range. The \"slow\" method scans fixed drive frequencies within a range, recording the beam response at each frequency. The “fast” approach drives the beam with a broadband chirp signal and analyzes the resulting single mode spectrum data. Both methods are tested during beam studies. Synchrotron frequency changes are measured in two setups: First, adjusting BLS voltage manually while keeping beam current constant. Second, BLS voltage varying as a function of decaying beam current. This paper presents, details of the measurement procedure and results from the beam-based machine studies.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP090.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP091",
      "title": "The beamline steering software for the APS Upgrade (APS-U) Accelerator Storage Ring258A new beamline steering software system is being developed for the Advanced Photon Source Upgrade (APS-U) accelerator storage ring. This system comprises three main components: The main steering server, which performs the actual beamline steering; The beamline steering server, which monitors users' steering requests and forwards them to the main steering server; And an operational steering application. The underlying steering functionality is managed by the Data Acquisition (DAQ) PV Group module. This module includes utilities for controlling and monitoring multiple scalar Channel Access (CA) Process Variables (PVs), combining their values into a single PV data object that is served on a specified PVA channel. Users can interact with the PV group either via PVA or through a set of control CA PVs hosted directly by the PV group controller. The new steering software is compatible with any kind of global orbit correction, running independently. It offers significant enhancements over the previous system, including parallelization capabilities and improved efficiency.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP091.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP092",
      "title": "The control and monitoring system for the APS-U front-end",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP092.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "XBPM261",
      "title": "The Advanced Photon Source Upgrade (APS-U) project aims to enhance the performance and capabilities of the APS, delivering brighter and more coherent x-ray beams to support cutting-edge scientific research. A critical component of this upgrade is the front-end X-ray Beam Position Monitor (XBPM) system, which plays a vital role in ensuring beam stability and precision. This paper presents the design and implementation of the control and monitoring system for the APS-U front-end XBP",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-XBPM261",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOP093",
      "title": "Towards accurate beam sigma matrix determination in a transport line using differentiable simulation264Precise characterization of the beam distribution is essential for matching the incoming beam and optimizing injection into storage rings. We present a method to efficiently reconstruct the full 5×5 beam sigma matrix (excluding the time coordinates) at the booster-to-storage-ring (BTS) transport line at the Advanced Photon Source Upgrade (APS-U). Earlier works demonstrated that the beam sigma matrix can be accurately reconstructed using linear transport matrices under the assumption of negligible chromatic effects. However, the presence of chromaticity introduced significant non-linearities and leads to discrepancies from the linear approaches. In this work, we demonstrate a novel approach leveraging Cheetah, a differentiable beam dynamics simulation framework, to enable direct gradient-based optimization of the beam matrix. Initial results shows efficient and accurate reconstruction under both linear and second-order tracking models, providing improved robustness in simulation studies. This method offers a scalable, interpretable, and computationally efficient alternative to black-box methods for beam matrix reconstruction in transport lines in presence of complex effects.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP093.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP094",
      "title": "Two-stage constrained Bayesian optimization for particle accelerator tuning268Particle accelerators are highly complex, non-linear systems that require rapid tuning during operation to meet requirements on beam qualities for applications in different scientific disciplines. Multi-objective Bayesian Optimization (MOBO) has been recently demonstrated at SLAC MeV-UED facility for speeding up online electron beam tunings and obtaining Pareto Fronts giving trade-offs between key beam properties of interest. One challenge in algorithm- based tuning is the alignments of beam through the collimators, screens and timing diagnostics under different system working points. This usually requires trial-and-error based hand tunings and strongly limits the data taking efficiency. Here, we utilize two-stage constrained Bayesian optimizations (CBE-MOBO) for beam tunings at MeV-UE",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP094.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP095",
      "title": "Ultra-fast switching utilizing an IVA topology for chopper applications272Recent trends in power electronics indicate increasing demand for fast response switching networks with sub nanosecond switching speed at a variety of volt-ages. Gate driving networks meet the desired switching speeds using COTS (Commercial Off-The Shelf) parts. This work describes an IVA (Inductive Voltage Adder) system capable of switching in the single digits of ns with a projected voltage output of 2 kV, using a gate driving topology to drive GaN (Gallium Nitride) HEMTs (High Electron Mobility Transistor). These rapid switching systems are proposed to be used in the LAMP (LANSCE Accelerator Modernization Project) chopper to effectively produce clean beam to select target stations, producing the needed output.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP095.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP095",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP096",
      "title": "Upgrade to fixed and translating scintillation-based loss detector system in the Fermilab Drift Tube Linac275The closed-off structure of the Fermilab Drift Tube Linac precludes a robust array of instrumentation from directly monitoring the H- beam that is accelerated from 750 keV to 116 Me",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP096.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP096",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP097",
      "title": "Machine learning-driven computations of 3D Coherent Synchrotron Radiation279Calculating the effects of Coherent Synchrotron Radiation (CSR) is one of the most computationally expensive tasks in accelerator physics. Here, we use convolutional neural networks (CNN's), along with a latent conditional diffusion (LCD) model, trained on physics-based simulations to speed up calculations. Specifically, we produce the 3D CSR wakefields generated by electron bunches in circular orbit in the steady-state condition. Two datasets are used for training and testing the models: wakefields generated by three-dimensional Gaussian electron distributions and wakefields from a sum of up to 25 three-dimensional Gaussian distributions. The CNN's are able to accurately produce the 3D wakefields $\\sim$250-1000 times faster than the numerical calculations, while the LCD has a gain of a factor of $\\sim$34. We also test the extrapolation and out-of-distribution generalization ability of the models. They generalize well on distributions with larger spreads than what they were trained on, but struggle with smaller spreads.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP097.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP097",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP099",
      "title": "X-ray inspection for non-invasive real-time beam detection283Conventional methods for measuring lower-energy particle beams (&LTseveral MeV), such as Faraday cups, moving wire scanners, and scintillators, are invasive and become impractical for higher-energy beams that exceed material tolerances. Current techniques for detecting beam drift often rely on spill radiation monitoring or beam position devices with off-axis electrodes, which can produce unwanted secondary particles. This study investigates a non-invasive X-ray inspection technique for beam characterization. Through simulations, we examine optimal X-ray energies, detector-beam configurations, scattering mechanisms, and profile reconstruction methods. The results demonstrate the feasibility of real-time beam monitoring without interfering with the primary beam path, offering significant benefits for high-energy physics experiments where maintaining beam integrity is essential.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP099.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP099",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP100",
      "title": "First results of the sXmap cavity field emission detection system from inside a cryomodule287Field emission (FE) has been one of the limiting factors in achieving high gradients in superconducting RF cavities. While the causes for FE are mostly known (contaminants on the inner cavity surface, dust, gases adsorbed…), identifying the exact location of field emitters has been a challenge. A detection system developed by Kyoto University has been developed to address this task, the sXmap system. This diagnostic device is made of inexpensive sensor strips that wrap around the iris of a multi cell SRF cavity that sense x-rays generated by F",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP100.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP100",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP102",
      "title": "Impedance modeling of in-vacuum undulator with Gaussian process290The impedance of in-vacuum undulators (IVUs) significantly affect the broadband impedance and, consequently, the beam dynamics in storage rings. During the IVU design phase, numerous iterative discussions between physicists and engineers are required, often involving extensive simulations of the complete 3D geometry, a few meters long, using limited computational resources. In this paper, we propose training a Gaussian process model with limited simulation data to emulate the physical model. We compare the predictions of the trained model to the simulation data and explore its application in optimizing the IVU design.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP102.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP102",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOP103",
      "title": "Online optimizations of NSLS-II Linac and Linac-to-Booster beam lines using machine learning methods294The NSLS-II is a cutting-edge 3 GeV storage ring light source around the world. The electron beam is initially accelerated in a linear accelerator to an energy of 170 MeV and subsequently accelerated in a booster synchrotron to a beam energy of 3 Ge",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/MOP103.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-MOP103",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 80,
  "scrape_time": "2025-11-03 23:55:09"
}