{
  "session_info": {
    "id": "WEYD",
    "name": "WEYD - Applications of Accelerators, Technology Transfer, Industrial Relations, and Outreach (Invited)",
    "url": "https://meow.elettra.eu/97/session/1182-weyd/index.html"
  },
  "papers": [
    {
      "paper_id": "WEYD01",
      "title": "A plan to revitalize the domestic superconducting radio-frequency industry637Superconducting radio-frequency (SRF) cavities are essential building blocks of modern particle accelerators for scientific research, and they offer unique capabilities that could be transformative for commercial applications. Growth of the domestic SRF industry in North America has faced several challenges over the past decades, as most of the international demand for cavities was supplied by European vendors. This contribution provides a brief review of the domestic industrial vendor space, an outlook of the global demand for SRF cavities and an outline of the challenges leading to this supply chain deficiency. One of the main challenges towards establishing a robust domestic SRF industry has been the large uncertainty in the demand. Meanwhile, research and development activities to raise technical readiness of SRF accelerators for industrial use have continued and several potential markets are emerging that may offer a consistent and growing demand for SRF cavities. Finally, reasons and means of establishing and sustaining competitive domestic suppliers are described.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/WEYD01.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-WEYD01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYD02",
      "title": "Accelerator-based medical isotope production: An overview of emerging trends and novel initiatives643Recent advances in drug development and radionuclide research have notably expanded the role of nuclear medicine in treating cancer over the past decade. Throughout such research and development efforts, the list of drug moieties and cancer types under investigation is paralleled by a similarly expansive list of radionuclides. This is because the suitability of a radionuclide for a therapeutic radiopharmaceutical application will depend on many factors including, but not limited to, the decay mode (e.g. α- vs β-emitter), the particle emission range, the matching of its half-life to the pharmacokinetics of the drug, and the co-emission of gamma rays of appropriate energy for imaging. Moreover, the successful adoption into clinical practice hinges on sustained, reliable, and cost-effective access to these radionuclides – a task which is not trivial. To this end, this presentation provides an overview of emerging trends in radionuclides (noting &LTsup>225</sup>Ac, &LTsup>211</sup>At, &LTsup>177</sup>Lu, and &LTsup>67</sup>Cu as examples), alongside novel initiatives for accelerator-based production strategies.",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "",
      "paper_url": "https://meow.elettra.eu/97/pdf/WEYD02.pdf",
      "poster_url": "",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2025-WEYD02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-11-04 00:03:54"
}